index.org
#+title: Configurations for GNU Emacs
#+author: takeounn
#+email: bararararatty@gmail.com
#+startup: content
#+startup: nohideblocks
#+options: num:t auto-id:t
#+setupfile: theme-readtheorg.setup
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

* はじめに
** 基本情報
   - repo: [[http://github.com/takeokunn/.emacs.d][takeokunn/.emacs.d]]
   - twitter: [[https://twitter.com/takeokunn][たけてぃ@takeokunn]]
** Dependency
   この emacs.dは以下のlibrary/packageに依存しています。
   - [[https://github.com/ggreer/the_silver_searcher][ggreer/the_silver_searcher]]
   - [[https://github.com/quicklisp/quicklisp-slime-helper][quicklisp/quicklisp-slime-helper]]
   - [[https://github.com/sbcl/sbcl][sbcl/sbcl]]
   - [[https://github.com/npm/cli][npm/cli]]
   - [[https://github.com/composer/composer][composer/composer]]
   - [[https://github.com/vterm/vterm][vterm/vterm]]
* 基本設定
** スタートアップメッセージを非表示
   url: [[http://flex.phys.tohoku.ac.jp/texi/eljman/eljman_250.html][http://flex.phys.tohoku.ac.jp/texi/eljman/eljman_250.html]]

   trueにすると最初のスタートアップメッセージ の表示を取りやめます。
   #+BEGIN_SRC emacs-lisp
     (setq inhibit-startup-message t)
   #+END_SRC
** 末尾のスペースを可視化する
   url: [[https://qiita.com/tadsan/items/df73c711f921708facdc][show-trailing-whitespaceは便利だが、見栄えが悪いこともある(qiita)]]

   特定のmode以外末尾のスペースを可視化するようにした。
   #+BEGIN_SRC emacs-lisp
     (setq-default show-trailing-whitespace t)

     (defun my/disable-trailing-mode-hook ()
       "Disable show tail whitespace."
       (setq show-trailing-whitespace nil))

     (defvar my/disable-trailing-modes
       '(comint-mode
         eshell-mode
         eww-mode
         term-mode
         twittering-mode
         minibuffer-inactive-mode))
     (mapc
      (lambda (mode)
        (add-hook (intern (concat (symbol-name mode) "-hook"))
                  'my/disable-trailing-mode-hook))
      my/disable-trailing-modes)
   #+END_SRC

** バーを非表示にする
   各種バーを非表示にした。
   #+BEGIN_SRC emacs-lisp
   #+END_SRC
** 行番号を表示する
   url: [[https://www.emacswiki.org/emacs/LineNumbers][https://www.emacswiki.org/emacs/LineNumbers]]
   #+BEGIN_SRC emacs-lisp
     (global-linum-mode t)
   #+END_SRC
** 自動生成ファイルを無効にする
   url: [[http://yohshiy.blog.fc2.com/blog-entry-319.html][http://yohshiy.blog.fc2.com/blog-entry-319.html]]
   #+BEGIN_SRC emacs-lisp
     (setq make-backup-files nil)
     (setq auto-save-default nil)
     (setq auto-save-list-file-prefix nil)
     (setq create-lockfiles nil)
   #+END_SRC
** C-kで行削除
   url: [[https://ayatakesi.github.io/emacs/24.5/Killing-by-Lines.html][https://ayatakesi.github.io/emacs/24.5/Killing-by-Lines.html]]
   #+BEGIN_SRC emacs-lisp
     (setq kill-whole-line t)
   #+END_SRC
** ビープ音を消す
   url: [[http://th.nao.ac.jp/MEMBER/zenitani/elisp-j.html#bell][http://th.nao.ac.jp/MEMBER/zenitani/elisp-j.html#bell]]
   #+BEGIN_SRC emacs-lisp
     (setq ring-bell-function 'ignore)
   #+END_SRC
