index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-09 Sat 19:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Configurations for GNU Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="takeounn" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Configurations for GNU Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2de2246">1. はじめに</a>
<ul>
<li><a href="#orgd7df125">1.1. 基本情報</a></li>
<li><a href="#org843bd32">1.2. Dependency</a></li>
</ul>
</li>
<li><a href="#orgcce8ea5">2. 基本設定</a>
<ul>
<li><a href="#org784b291">2.1. スタートアップメッセージを非表示</a></li>
<li><a href="#org376998c">2.2. 末尾のスペースを可視化する</a></li>
<li><a href="#orgf8bf5b1">2.3. バーを非表示にする</a></li>
<li><a href="#org33e0e0f">2.4. 行番号を表示する</a></li>
<li><a href="#org30a3995">2.5. 自動生成ファイルを無効にする</a></li>
<li><a href="#orge8d4aa9">2.6. C-kで行削除</a></li>
<li><a href="#orge9ec461">2.7. ビープ音を消す</a></li>
<li><a href="#orgd5e26ec">2.8. カッコの中をハイライトする</a></li>
<li><a href="#org67ddd6d">2.9. カッコが自動的に作られるようにする</a></li>
<li><a href="#org19a30ea">2.10. ウィンドウの大きさを変える</a></li>
<li><a href="#orge88d1dc">2.11. time locale</a></li>
<li><a href="#org3d217db">2.12. rubyのマジックコードを非表示</a></li>
<li><a href="#orgb493b31">2.13. 起動時にerrorの時のみ表示する</a></li>
<li><a href="#org5ca08c1">2.14. ナローイングを無効</a></li>
<li><a href="#org54a23e0">2.15. Font</a></li>
<li><a href="#org10d734c">2.16. GC</a></li>
<li><a href="#orgde261e0">2.17. indent</a></li>
<li><a href="#org38fdd3b">2.18. early-init</a></li>
<li><a href="#org271ea4a">2.19. ielm</a></li>
</ul>
</li>
<li><a href="#org4662ad1">3. Package管理ツール</a>
<ul>
<li><a href="#org2f9c4c2">3.1. Cask</a></li>
<li><a href="#org71b4bdf">3.2. use-package</a></li>
</ul>
</li>
<li><a href="#org8e913f4">4. org-mode設定</a>
<ul>
<li><a href="#orge86e4ab">4.1. 基本設定</a></li>
<li><a href="#org1cb006b">4.2. keybind</a></li>
</ul>
</li>
<li><a href="#org2c7bd61">5. テーマ</a>
<ul>
<li><a href="#org6fae4f6">5.1. neotree</a></li>
<li><a href="#orgc754a88">5.2. doom-theme</a></li>
</ul>
</li>
<li><a href="#org901d6cf">6. Package</a>
<ul>
<li><a href="#org564222a">6.1. hl-line</a></li>
<li><a href="#orgec1b7c6">6.2. hl-todo</a></li>
<li><a href="#org9ca8837">6.3. all-the-icons</a></li>
<li><a href="#org85f2915">6.4. all-the-icons-ivy</a></li>
<li><a href="#org30001be">6.5. editorconfig</a></li>
<li><a href="#org94c39ff">6.6. open-junk-file</a></li>
<li><a href="#orgec8b415">6.7. smartrep/multiple-cursors</a></li>
<li><a href="#orgd004e35">6.8. yasnippet</a></li>
<li><a href="#org98e2ec5">6.9. counsel</a></li>
<li><a href="#org8af721a">6.10. recentf</a></li>
<li><a href="#org5a9c623">6.11. magit</a></li>
<li><a href="#org6e30c73">6.12. ivy-rich</a></li>
<li><a href="#org8a04512">6.13. ace-window</a></li>
<li><a href="#org3fc6440">6.14. goto-addr</a></li>
<li><a href="#org5a925ba">6.15. swoop</a></li>
<li><a href="#orgc807846">6.16. whitespace</a></li>
<li><a href="#orgee8b621">6.17. dashboard</a></li>
<li><a href="#orgb6656c2">6.18. company</a></li>
<li><a href="#orgfe771bf">6.19. git-gutter</a></li>
<li><a href="#org14233ad">6.20. smooth-scroll</a></li>
<li><a href="#orgc1ca1a2">6.21. exec-path-from-shell</a></li>
<li><a href="#org979f013">6.22. hindent</a></li>
<li><a href="#org3366eb8">6.23. tide</a></li>
<li><a href="#org787c5fc">6.24. ivy-ghq</a></li>
<li><a href="#orge921ddf">6.25. vterm</a></li>
<li><a href="#org898c3a8">6.26. omnisharp</a></li>
<li><a href="#org0832150">6.27. nameless</a></li>
<li><a href="#org47fe224">6.28. esup</a></li>
<li><a href="#orgfddc655">6.29. robe</a></li>
<li><a href="#orgf5cb3a4">6.30. rubocop</a></li>
<li><a href="#org3617edc">6.31. flycheck</a></li>
<li><a href="#org5fff30b">6.32. helpful</a></li>
<li><a href="#org91bf3a2">6.33. sql-indent</a></li>
<li><a href="#org7798214">6.34. aweshell</a></li>
<li><a href="#org0c8c082">6.35. racer</a></li>
<li><a href="#org2a1cee2">6.36. rastic</a></li>
</ul>
</li>
<li><a href="#orgcb19503">7. Lisp</a>
<ul>
<li><a href="#orgf787bfd">7.1. slime</a></li>
<li><a href="#orgd31785f">7.2. paredit</a></li>
<li><a href="#org5631885">7.3. hyperspec</a></li>
<li><a href="#org39894a3">7.4. rainbow-dpelimiters</a></li>
<li><a href="#org565c84e">7.5. cider</a></li>
</ul>
</li>
<li><a href="#org6a2fa5f">8. LSP</a>
<ul>
<li><a href="#orgc5a087c">8.1. lsp-mode</a></li>
<li><a href="#orge7d3844">8.2. lsp-ui</a></li>
<li><a href="#org6b147c7">8.3. company-lsp</a></li>
<li><a href="#orged2a7b2">8.4. dap-mode</a></li>
</ul>
</li>
<li><a href="#org427d05b">9. Mode</a>
<ul>
<li><a href="#orgc5ad6f2">9.1. fundamental-mode</a></li>
<li><a href="#org2e2322b">9.2. ruby-mode</a></li>
<li><a href="#orgcf9a8da">9.3. lisp-mode</a></li>
<li><a href="#org29a5f30">9.4. web-mode</a></li>
<li><a href="#org4dbfe7c">9.5. go-mode</a></li>
<li><a href="#orgacd14a3">9.6. terraform-mode</a></li>
<li><a href="#org979a13a">9.7. markdown-mode</a></li>
<li><a href="#orgf4d195e">9.8. yaml-mode</a></li>
<li><a href="#orgd7f2c3f">9.9. json-mode</a></li>
<li><a href="#orgf8b592d">9.10. dockerfile-mode</a></li>
<li><a href="#orgd217ffc">9.11. fish-mode</a></li>
<li><a href="#org4264cdd">9.12. dhall-mode</a></li>
<li><a href="#org2e3c970">9.13. js2-mode</a></li>
<li><a href="#org53a7051">9.14. typescript-mode</a></li>
<li><a href="#orgc63ebdd">9.15. slim-mode</a></li>
<li><a href="#org1ea90b2">9.16. coffee-mode</a></li>
<li><a href="#orgf64e681">9.17. scala-mode</a></li>
<li><a href="#org5f48579">9.18. nginx-mode</a></li>
<li><a href="#org40f2e06">9.19. ssh-config-mode</a></li>
<li><a href="#orge76629b">9.20. php-mode</a></li>
<li><a href="#org4c01e03">9.21. clojure-mode</a></li>
<li><a href="#org0c6aeb6">9.22. vue-mode</a></li>
<li><a href="#org28de2d6">9.23. glsl-mode</a></li>
<li><a href="#org598c8d4">9.24. emmet-mode</a></li>
<li><a href="#orgb3bd9e7">9.25. nyan-mode</a></li>
<li><a href="#org4d68fa6">9.26. haskell-mode</a></li>
<li><a href="#org3d4b6ef">9.27. gradle-mode</a></li>
<li><a href="#org17bd798">9.28. cmake-mode</a></li>
<li><a href="#org59ac9b2">9.29. toml-mode</a></li>
<li><a href="#org8df4dfc">9.30. gitignore-mode</a></li>
<li><a href="#org56bce3a">9.31. plantuml-mode</a></li>
<li><a href="#orgaedf692">9.32. processing-mode</a></li>
<li><a href="#org9fc766a">9.33. csharp-mode</a></li>
<li><a href="#org76f34a3">9.34. docker-compose-mode</a></li>
<li><a href="#org65c0b5e">9.35. rust-mode</a></li>
</ul>
</li>
<li><a href="#org1c17d12">10. Refactor</a>
<ul>
<li><a href="#org572e5d6">10.1. emr</a></li>
<li><a href="#org75d9422">10.2. js2-refactor</a></li>
<li><a href="#org1b28442">10.3. ruby-refactor</a></li>
</ul>
</li>
<li><a href="#orgbd05f08">11. MyFunc</a>
<ul>
<li><a href="#org25fdc62">11.1. my/beginning-of-intendation</a></li>
<li><a href="#orgf9c183f">11.2. my/ido-recentf</a></li>
<li><a href="#orgcc28c02">11.3. my/suspend</a></li>
<li><a href="#org83d50c0">11.4. my/counsel-fd</a></li>
<li><a href="#org78901ea">11.5. my/before-set-auto-mode</a></li>
<li><a href="#orgece2e2d">11.6. my/exec-npm-script</a></li>
<li><a href="#orgbce5bda">11.7. my/slime-history</a></li>
<li><a href="#org3c855dc">11.8. my/ielm-history</a></li>
<li><a href="#org4bff871">11.9. my/irb-history</a></li>
<li><a href="#orgc3a83f5">11.10. my/neotree-toggle</a></li>
</ul>
</li>
<li><a href="#orgdb3ddf3">12. Keybind</a>
<ul>
<li><a href="#org6b72808">12.1. 基本設定</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2de2246" class="outline-2">
<h2 id="org2de2246"><span class="section-number-2">1</span> はじめに</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd7df125" class="outline-3">
<h3 id="orgd7df125"><span class="section-number-3">1.1</span> 基本情報</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>repo: <a href="http://github.com/takeokunn/.emacs.d">takeokunn/.emacs.d</a></li>
<li>twitter: <a href="https://twitter.com/takeokunn">たけてぃ@takeokunn</a></li>
</ul>
</div>
</div>
<div id="outline-container-org843bd32" class="outline-3">
<h3 id="org843bd32"><span class="section-number-3">1.2</span> Dependency</h3>
<div class="outline-text-3" id="text-1-2">
<p>
この emacs.dは以下のlibrary/packageに依存しています。
</p>
<ul class="org-ul">
<li><a href="https://github.com/ggreer/the_silver_searcher">ggreer/the<sub>silver</sub><sub>searcher</sub></a></li>
<li><a href="https://github.com/quicklisp/quicklisp-slime-helper">quicklisp/quicklisp-slime-helper</a></li>
<li><a href="https://github.com/sbcl/sbcl">sbcl/sbcl</a></li>
<li><a href="https://github.com/npm/cli">npm/cli</a></li>
<li><a href="https://github.com/composer/composer">composer/composer</a></li>
<li><a href="https://github.com/vterm/vterm">vterm/vterm</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcce8ea5" class="outline-2">
<h2 id="orgcce8ea5"><span class="section-number-2">2</span> 基本設定</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org784b291" class="outline-3">
<h3 id="org784b291"><span class="section-number-3">2.1</span> スタートアップメッセージを非表示</h3>
<div class="outline-text-3" id="text-2-1">
<p>
url: <a href="http://flex.phys.tohoku.ac.jp/texi/eljman/eljman_250.html">http://flex.phys.tohoku.ac.jp/texi/eljman/eljman<sub>250.html</sub></a>
</p>

<p>
trueにすると最初のスタートアップメッセージ の表示を取りやめます。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq inhibit-startup-message t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org376998c" class="outline-3">
<h3 id="org376998c"><span class="section-number-3">2.2</span> 末尾のスペースを可視化する</h3>
<div class="outline-text-3" id="text-2-2">
<p>
url: <a href="https://qiita.com/tadsan/items/df73c711f921708facdc">show-trailing-whitespaceは便利だが、見栄えが悪いこともある(qiita)</a>
</p>

<p>
特定のmode以外末尾のスペースを可視化するようにした。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq-default show-trailing-whitespace t)

(defun my/disable-trailing-mode-hook ()
  "Disable show tail whitespace."
  (setq show-trailing-whitespace nil))

(defvar my/disable-trailing-modes
  '(comint-mode
    eshell-mode
    eww-mode
    term-mode
    twittering-mode
    minibuffer-inactive-mode))
(mapc
 (lambda (mode)
   (add-hook (intern (concat (symbol-name mode) "-hook"))
	     'my/disable-trailing-mode-hook))
 my/disable-trailing-modes)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8bf5b1" class="outline-3">
<h3 id="orgf8bf5b1"><span class="section-number-3">2.3</span> バーを非表示にする</h3>
<div class="outline-text-3" id="text-2-3">
<p>
各種バーを非表示にした。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
</pre>
</div>
</div>
</div>
<div id="outline-container-org33e0e0f" class="outline-3">
<h3 id="org33e0e0f"><span class="section-number-3">2.4</span> 行番号を表示する</h3>
<div class="outline-text-3" id="text-2-4">
<p>
url: <a href="https://www.emacswiki.org/emacs/LineNumbers">https://www.emacswiki.org/emacs/LineNumbers</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-linum-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org30a3995" class="outline-3">
<h3 id="org30a3995"><span class="section-number-3">2.5</span> 自動生成ファイルを無効にする</h3>
<div class="outline-text-3" id="text-2-5">
<p>
url: <a href="http://yohshiy.blog.fc2.com/blog-entry-319.html">http://yohshiy.blog.fc2.com/blog-entry-319.html</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq make-backup-files nil)
(setq auto-save-default nil)
(setq auto-save-list-file-prefix nil)
(setq create-lockfiles nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge8d4aa9" class="outline-3">
<h3 id="orge8d4aa9"><span class="section-number-3">2.6</span> C-kで行削除</h3>
<div class="outline-text-3" id="text-2-6">
<p>
url: <a href="https://ayatakesi.github.io/emacs/24.5/Killing-by-Lines.html">https://ayatakesi.github.io/emacs/24.5/Killing-by-Lines.html</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq kill-whole-line t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge9ec461" class="outline-3">
<h3 id="orge9ec461"><span class="section-number-3">2.7</span> ビープ音を消す</h3>
<div class="outline-text-3" id="text-2-7">
<p>
url: <a href="http://th.nao.ac.jp/MEMBER/zenitani/elisp-j.html#bell">http://th.nao.ac.jp/MEMBER/zenitani/elisp-j.html#bell</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq ring-bell-function 'ignore)
</pre>
</div>
</div>
</div>
