index.org
** カッコの中をハイライトする
   url: [[http://syohex.hatenablog.com/entry/20110331/1301584188][http://syohex.hatenablog.com/entry/20110331/1301584188]]
   #+BEGIN_SRC emacs-lisp
     (show-paren-mode t)
     (setq show-paren-style 'mixed)
   #+END_SRC
** カッコが自動的に作られるようにする
   url: [[https://www.emacswiki.org/emacs/ElectricPair][https://www.emacswiki.org/emacs/ElectricPair]]
   #+BEGIN_SRC emacs-lisp
     (electric-pair-mode 1)
   #+END_SRC
** ウィンドウの大きさを変える
   url: [[http://flex.phys.tohoku.ac.jp/texi/eljman/eljman_184.html][http://flex.phys.tohoku.ac.jp/texi/eljman/eljman_184.html]]
   #+BEGIN_SRC emacs-lisp
     (setq window-min-height 10)
   #+END_SRC
** time locale
   url: [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Locales.html][https://www.gnu.org/software/emacs/manual/html_node/elisp/Locales.html]]
   #+BEGIN_SRC emacs-lisp
     (setq system-time-locale "C")
   #+END_SRC
** rubyのマジックコードを非表示
   url: [[https://mat-aki.hatenadiary.org/entry/20090210/1234234027][https://mat-aki.hatenadiary.org/entry/20090210/1234234027]]
   #+BEGIN_SRC emacs-lisp
     (setq ruby-insert-encoding-magic-comment nil)
   #+END_SRC
** 起動時にerrorの時のみ表示する
   url: [[https://qiita.com/kakikubo/items/412715e378b03b79faff][https://qiita.com/kakikubo/items/412715e378b03b79faff]]
   #+BEGIN_SRC emacs-lisp
     (setq display-warning-minimum-level :error)
   #+END_SRC
** ナローイングを無効
   url: [[https://ayatakesi.github.io/emacs/26.1/html/Narrowing.html][https://ayatakesi.github.io/emacs/26.1/html/Narrowing.html]]
   #+BEGIN_SRC emacs-lisp
     (put 'narrow-to-region 'disabled nil)
   #+END_SRC
** Font
   url: [[https://qiita.com/j8takagi/items/01aecdd28f87cdd3cd2c][https://qiita.com/j8takagi/items/01aecdd28f87cdd3cd2c]]
   #+BEGIN_SRC emacs-lisp
     (set-fontset-font t 'japanese-jisx0208 "TakaoPGothic")
     (add-to-list 'face-font-rescale-alist '(".*Takao P.*" . 0.85))
   #+END_SRC
** GC
   #+BEGIN_SRC emacs-lisp
     (setq gc-cons-threshold (* 128 1024 1024)) ;; 128MB
     (setq garbage-collection-messages t)
   #+END_SRC
** indent
   #+BEGIN_SRC emacs-lisp
     (setq-default indent-tabs-mode nil)
   #+END_SRC
** early-init
   #+BEGIN_SRC emacs-lisp
     (if (version< emacs-version "27")
         (progn
           (menu-bar-mode -1)
           (tool-bar-mode -1)
           (toggle-scroll-bar -1)))
   #+END_SRC
** ielm
   #+BEGIN_SRC emacs-lisp
     (defun my/ielm-write-history-on-exit (process event)
       (comint-write-input-ring)
       (let ((buf (process-buffer process)))
         (when (buffer-live-p buf)
           (with-current-buffer buf
             (insert (format "\nProcess %s %s" process event))))))

     (defun my/ielm-turn-on-history ()
       (let ((process (get-buffer-process (current-buffer))))
         (when process
           (setq comint-input-ring-file-name (concat (file-remote-p default-directory) "~/.ielm-history"))
           (setq comint-input-ring-size 100000)
           (setq comint-input-ignoredups t)
           (comint-read-input-ring)
           (add-hook 'kill-buffer-hook #'comint-write-input-ring)
           (define-key ielm-map (kbd "C-c C-r") 'my/ielm-history)

           (set-process-sentinel process #'my/ielm-write-history-on-exit))))

     (add-hook 'ielm-mode-hook 'my/ielm-turn-on-history)
   #+END_SRC
* Package管理ツール
** Cask
   url: [[https://github.com/cask/cask][cask/cask]]

   package managerにはCaskを使っています。
   #+BEGIN_SRC emacs-lisp
     (require 'cask "~/.cask/cask.el")
     (cask-initialize)
  #+END_SRC
** use-package
   [[https://qiita.com/kai2nenobu/items/5dfae3767514584f5220][use-packageで可読性の高いinit.elを書く(qiita)]] を参考に書いていく。

   #+begin_src emacs-lisp
     (require 'bind-key)
   #+end_src
* org-mode設定
** 基本設定
   #+BEGIN_SRC emacs-lisp
     (setq org-use-speed-commands t)
     (setq org-agenda-todo-ignore-with-date t)
     (setq org-directory "~/emacs/org")
     (setq org-agenda-files '("~/emacs/org/todo.org"))
     (setq org-capture-templates
           '(("t" "New TODO" entry
              (file+headline "~/emacs/org/todo.org" "TODO")
              "* TODO %?\n\n")
             ("m" "Memo" entry
              (file+headline "~/emacs/org/memo.org" "MEMO")
              "* %U%?\n%i\n%a")))
     (setq org-agenda-custom-commands
           '(("a" "Agenda and TODO"
              ((agenda "")
               (alltodo "")))))
     (put 'set-goal-column 'disabled nil)
  #+END_SRC
** keybind
   #+BEGIN_SRC emacs-lisp
     (add-hook 'org-mode-hook
               (lambda ()
                 (define-key org-mode-map (kbd "C-m") nil)))
   #+END_SRC
* テーマ
