index.html
<div id="outline-container-orgd5e26ec" class="outline-3">
<h3 id="orgd5e26ec"><span class="section-number-3">2.8</span> カッコの中をハイライトする</h3>
<div class="outline-text-3" id="text-2-8">
<p>
url: <a href="http://syohex.hatenablog.com/entry/20110331/1301584188">http://syohex.hatenablog.com/entry/20110331/1301584188</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(show-paren-mode t)
(setq show-paren-style 'mixed)
</pre>
</div>
</div>
</div>
<div id="outline-container-org67ddd6d" class="outline-3">
<h3 id="org67ddd6d"><span class="section-number-3">2.9</span> カッコが自動的に作られるようにする</h3>
<div class="outline-text-3" id="text-2-9">
<p>
url: <a href="https://www.emacswiki.org/emacs/ElectricPair">https://www.emacswiki.org/emacs/ElectricPair</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(electric-pair-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org19a30ea" class="outline-3">
<h3 id="org19a30ea"><span class="section-number-3">2.10</span> ウィンドウの大きさを変える</h3>
<div class="outline-text-3" id="text-2-10">
<p>
url: <a href="http://flex.phys.tohoku.ac.jp/texi/eljman/eljman_184.html">http://flex.phys.tohoku.ac.jp/texi/eljman/eljman<sub>184.html</sub></a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq window-min-height 10)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge88d1dc" class="outline-3">
<h3 id="orge88d1dc"><span class="section-number-3">2.11</span> time locale</h3>
<div class="outline-text-3" id="text-2-11">
<p>
url: <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Locales.html">https://www.gnu.org/software/emacs/manual/html<sub>node</sub>/elisp/Locales.html</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq system-time-locale "C")
</pre>
</div>
</div>
</div>
<div id="outline-container-org3d217db" class="outline-3">
<h3 id="org3d217db"><span class="section-number-3">2.12</span> rubyのマジックコードを非表示</h3>
<div class="outline-text-3" id="text-2-12">
<p>
url: <a href="https://mat-aki.hatenadiary.org/entry/20090210/1234234027">https://mat-aki.hatenadiary.org/entry/20090210/1234234027</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq ruby-insert-encoding-magic-comment nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb493b31" class="outline-3">
<h3 id="orgb493b31"><span class="section-number-3">2.13</span> 起動時にerrorの時のみ表示する</h3>
<div class="outline-text-3" id="text-2-13">
<p>
url: <a href="https://qiita.com/kakikubo/items/412715e378b03b79faff">https://qiita.com/kakikubo/items/412715e378b03b79faff</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq display-warning-minimum-level :error)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ca08c1" class="outline-3">
<h3 id="org5ca08c1"><span class="section-number-3">2.14</span> ナローイングを無効</h3>
<div class="outline-text-3" id="text-2-14">
<p>
url: <a href="https://ayatakesi.github.io/emacs/26.1/html/Narrowing.html">https://ayatakesi.github.io/emacs/26.1/html/Narrowing.html</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(put 'narrow-to-region 'disabled nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org54a23e0" class="outline-3">
<h3 id="org54a23e0"><span class="section-number-3">2.15</span> Font</h3>
<div class="outline-text-3" id="text-2-15">
<p>
url: <a href="https://qiita.com/j8takagi/items/01aecdd28f87cdd3cd2c">https://qiita.com/j8takagi/items/01aecdd28f87cdd3cd2c</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-fontset-font t 'japanese-jisx0208 "TakaoPGothic")
(add-to-list 'face-font-rescale-alist '(".*Takao P.*" . 0.85))
</pre>
</div>
</div>
</div>
<div id="outline-container-org10d734c" class="outline-3">
<h3 id="org10d734c"><span class="section-number-3">2.16</span> GC</h3>
<div class="outline-text-3" id="text-2-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq gc-cons-threshold (* 128 1024 1024)) ;; 128MB
(setq garbage-collection-messages t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgde261e0" class="outline-3">
<h3 id="orgde261e0"><span class="section-number-3">2.17</span> indent</h3>
<div class="outline-text-3" id="text-2-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq-default indent-tabs-mode nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org38fdd3b" class="outline-3">
<h3 id="org38fdd3b"><span class="section-number-3">2.18</span> early-init</h3>
<div class="outline-text-3" id="text-2-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(if (version&lt; emacs-version "27")
    (progn
      (menu-bar-mode -1)
      (tool-bar-mode -1)
      (toggle-scroll-bar -1)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org271ea4a" class="outline-3">
<h3 id="org271ea4a"><span class="section-number-3">2.19</span> ielm</h3>
<div class="outline-text-3" id="text-2-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/ielm-write-history-on-exit (process event)
  (comint-write-input-ring)
  (let ((buf (process-buffer process)))
    (when (buffer-live-p buf)
      (with-current-buffer buf
	(insert (format "\nProcess %s %s" process event))))))

(defun my/ielm-turn-on-history ()
  (let ((process (get-buffer-process (current-buffer))))
    (when process
      (setq comint-input-ring-file-name (concat (file-remote-p default-directory) "~/.ielm-history"))
      (setq comint-input-ring-size 100000)
      (setq comint-input-ignoredups t)
      (comint-read-input-ring)
      (add-hook 'kill-buffer-hook #'comint-write-input-ring)
      (define-key ielm-map (kbd "C-c C-r") 'my/ielm-history)

      (set-process-sentinel process #'my/ielm-write-history-on-exit))))

(add-hook 'ielm-mode-hook 'my/ielm-turn-on-history)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4662ad1" class="outline-2">
<h2 id="org4662ad1"><span class="section-number-2">3</span> Package管理ツール</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2f9c4c2" class="outline-3">
<h3 id="org2f9c4c2"><span class="section-number-3">3.1</span> Cask</h3>
<div class="outline-text-3" id="text-3-1">
<p>
url: <a href="https://github.com/cask/cask">cask/cask</a>
</p>

<p>
package managerにはCaskを使っています。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'cask "~/.cask/cask.el")
(cask-initialize)
</pre>
</div>
</div>
</div>
<div id="outline-container-org71b4bdf" class="outline-3">
<h3 id="org71b4bdf"><span class="section-number-3">3.2</span> use-package</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://qiita.com/kai2nenobu/items/5dfae3767514584f5220">use-packageで可読性の高いinit.elを書く(qiita)</a> を参考に書いていく。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'bind-key)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8e913f4" class="outline-2">
<h2 id="org8e913f4"><span class="section-number-2">4</span> org-mode設定</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge86e4ab" class="outline-3">
<h3 id="orge86e4ab"><span class="section-number-3">4.1</span> 基本設定</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-use-speed-commands t)
(setq org-agenda-todo-ignore-with-date t)
(setq org-directory "~/emacs/org")
(setq org-agenda-files '("~/emacs/org/todo.org"))
(setq org-capture-templates
      '(("t" "New TODO" entry
	 (file+headline "~/emacs/org/todo.org" "TODO")
	 "* TODO %?\n\n")
	("m" "Memo" entry
	 (file+headline "~/emacs/org/memo.org" "MEMO")
	 "* %U%?\n%i\n%a")))
(setq org-agenda-custom-commands
      '(("a" "Agenda and TODO"
	 ((agenda "")
	  (alltodo "")))))
(put 'set-goal-column 'disabled nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1cb006b" class="outline-3">
<h3 id="org1cb006b"><span class="section-number-3">4.2</span> keybind</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'org-mode-hook
	  (lambda ()
	    (define-key org-mode-map (kbd "C-m") nil)))
</pre>
</div>
</div>
</div>
</div>
