index.org
** neotree
   #+BEGIN_SRC emacs-lisp
     (use-package neotree
       :init
       (add-hook 'neotree-mode-hook
                 (lambda ()
                   (with-current-buffer " *NeoTree*"
                     (setq-local linum-mode nil))))
       :config
       (setq-default neo-show-hidden-files t)
       (setq neo-window-fixed-size nil)
       (defun neo-buffer--insert-fold-symbol (name &optional file-name)
         "Custom overriding function for the fold symbol.
         `NAME' decides what fold icon to use, while `FILE-NAME' decides
         what file icon to use."
         (or (and (equal name 'open)  (insert (all-the-icons-icon-for-dir file-name "down")))
             (and (equal name 'close) (insert (all-the-icons-icon-for-dir file-name "right")))
             (and (equal name 'leaf)  (insert (format "\t\t\t%s\t" (all-the-icons-icon-for-file file-name))))))
       (defun neo-buffer--insert-dir-entry (node depth expanded)
         (let ((node-short-name (neo-path--file-short-name node)))
           (insert-char ?\s (* (- depth 1) 2)) ; indent
           (when (memq 'char neo-vc-integration)
             (insert-char ?\s 2))
           (neo-buffer--insert-fold-symbol
            (if expanded 'open 'close) node)
           (insert-button (concat node-short-name "/")
                          'follow-link t
                          'face neo-dir-link-face
                          'neo-full-path node
                          'keymap neotree-dir-button-keymap)
           (neo-buffer--node-list-set nil node)
           (neo-buffer--newline-and-begin)))
       (defun neo-buffer--insert-file-entry (node depth)
         (let ((node-short-name (neo-path--file-short-name node))
               (vc (when neo-vc-integration (neo-vc-for-node node))))
           (insert-char ?\s (* (- depth 1) 2)) ; indent
           (when (memq 'char neo-vc-integration)
             (insert-char (car vc))
             (insert-char ?\s))
           (neo-buffer--insert-fold-symbol 'leaf node-short-name)
           (insert-button node-short-name
                          'follow-link t
                          'face (if (memq 'face neo-vc-integration)
                                    (cdr vc)
                                  neo-file-link-face)
                          'neo-full-path node
                          'keymap neotree-file-button-keymap)
           (neo-buffer--node-list-set nil node)
           (neo-buffer--newline-and-begin)))
       :custom
       (neo-theme 'nerd2))
   #+END_SRC
** doom-theme
   #+BEGIN_SRC emacs-lisp
     ;; doom themes
     (use-package doom-themes
       :custom
       (doom-themes-enable-italic t)
       (doom-themes-enable-bold t)
       :custom-face
       (doom-modeline-bar ((t (:background "#6272a4"))))
       :config
       (load-theme 'tango-dark t)
       (doom-themes-neotree-config)
       (doom-themes-org-config))

     ;; doom modeline
     (use-package doom-modeline
       :custom
       (doom-modeline-buffer-file-name-style 'truncate-with-project)
       (doom-modeline-icon t)
       (doom-modeline-major-mode-icon nil)
       (doom-modeline-minor-modes nil)
       :hook
       (after-init . doom-modeline-mode)
       :config
       (line-number-mode 0)
       (column-number-mode 0))
  #+END_SRC
* Package
** hl-line
   url: [[https://www.emacswiki.org/emacs/HighlightCurrentLine][https://www.emacswiki.org/emacs/HighlightCurrentLine]]

   現在の行をハイライトするパッケージ。
   #+BEGIN_SRC emacs-lisp
     (use-package hl-line
       :config
       (set-face-background 'hl-line "#444642")
       (set-face-attribute 'hl-line nil :inherit nil)
       (defvar global-hl-line-timer-exclude-modes '(todotxt-mode))
       (defun global-hl-line-timer-function ()
         (unless (memq major-mode global-hl-line-timer-exclude-modes)
           (global-hl-line-unhighlight-all)
           (let ((global-hl-line-mode t))
             (global-hl-line-highlight))))
       (setq global-hl-line-timer
             (run-with-idle-timer 0.03 t 'global-hl-line-timer-function)))
   #+END_SRC
** hl-todo
   url: [[http://emacs.rubikitch.com/hl-todo/][http://emacs.rubikitch.com/hl-todo/]]

   TODOやFIXMEなどのキーワードをハイライトするパッケージ。
   #+BEGIN_SRC emacs-lisp
     (use-package hl-todo
       :init
       (global-hl-todo-mode 1)
       :config
       (setq hl-todo-keyword-faces
             '(("HOLD" . "#d0bf8f")
               ("TODO" . "#cc9393")
               ("NEXT" . "#dca3a3")
               ("THEM" . "#dc8cc3")
               ("PROG" . "#7cb8bb")
               ("OKAY" . "#7cb8bb")
               ("DONT" . "#5f7f5f")
               ("FAIL" . "#8c5353")
               ("DONE" . "#afd8af")
               ("FIXME" . "#cc9393")
               ("???"   . "#cc9393"))))
   #+END_SRC
** all-the-icons
   url: [[https://github.com/domtronn/all-the-icons.el][https://github.com/domtronn/all-the-icons.el]]

   アイコンを追加するパッケージ。dired-mode時のみ有効にしている。
   #+BEGIN_SRC emacs-lisp
     (use-package all-the-icons
       :init
       (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
   #+END_SRC
** all-the-icons-ivy
   url: [[https://github.com/asok/all-the-icons-ivy][https://github.com/asok/all-the-icons-ivy]]
   #+BEGIN_SRC emacs-lisp
     (use-package all-the-icons-ivy
       :config
       (all-the-icons-ivy-setup))
   #+END_SRC
** editorconfig
   url: [[https://github.com/editorconfig/editorconfig-emacs][https://github.com/editorconfig/editorconfig-emacs]]

   editorconfigを有効にするパッケージ。
   #+BEGIN_SRC emacs-lisp
     (use-package editorconfig
       :config
       (editorconfig-mode 1))
   #+END_SRC
** open-junk-file
   url: [[https://www.emacswiki.org/emacs/open-junk-file.el][https://www.emacswiki.org/emacs/open-junk-file.el]]

   使い捨てファイルを作成するパッケージ。
   #+BEGIN_SRC emacs-lisp
     (use-package open-junk-file
       :config
       (setq open-junk-file-format "~/.emacs.d/.junk/%Y-%m%d-%H%M%S."))
   #+END_SRC
** smartrep/multiple-cursors
   url: [[https://qiita.com/scalper/items/b9e357b3af071c930777][https://qiita.com/scalper/items/b9e357b3af071c930777]]

   複数cursorを便利に扱えるようにした。
   #+BEGIN_SRC emacs-lisp
     (use-package multiple-cursors
       :init
       (require 'smartrep)
       (declare-function smartrep-define-key "smartrep")
       (bind-key "C-M-c" 'mc/edit-lines)
       (bind-key "C-M-r" 'mc/mark-all-in-region)
       (global-unset-key (kbd "C-t"))
       (smartrep-define-key global-map "C-t"
         '(("C-t" . 'mc/mark-next-like-this)
           ("n"   . 'mc/mark-next-like-this)
           ("p"   . 'mc/mark-previous-like-this)
           ("m"   . 'mc/mark-more-like-this-extended)
           ("u"   . 'mc/unmark-next-like-this)
           ("U"   . 'mc/unmark-previous-like-this)
           ("s"   . 'mc/skip-to-next-like-this)
           ("S"   . 'mc/skip-to-previous-like-this)
           ("*"   . 'mc/mark-all-like-this)
           ("d"   . 'mc/mark-all-like-this-dwim)
           ("i"   . 'mc/insert-numbers)
           ("o"   . 'mc/sort-regions)
           ("O"   . 'mc/reverse-regions))))
   #+END_SRC
