index.html
<div id="outline-container-org2c7bd61" class="outline-2">
<h2 id="org2c7bd61"><span class="section-number-2">5</span> テーマ</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6fae4f6" class="outline-3">
<h3 id="org6fae4f6"><span class="section-number-3">5.1</span> neotree</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package neotree
  :init
  (add-hook 'neotree-mode-hook
	    (lambda ()
	      (with-current-buffer " *NeoTree*"
		(setq-local linum-mode nil))))
  :config
  (setq-default neo-show-hidden-files t)
  (setq neo-window-fixed-size nil)
  (defun neo-buffer--insert-fold-symbol (name &amp;optional file-name)
    "Custom overriding function for the fold symbol.
    `NAME' decides what fold icon to use, while `FILE-NAME' decides
    what file icon to use."
    (or (and (equal name 'open)  (insert (all-the-icons-icon-for-dir file-name "down")))
	(and (equal name 'close) (insert (all-the-icons-icon-for-dir file-name "right")))
	(and (equal name 'leaf)  (insert (format "\t\t\t%s\t" (all-the-icons-icon-for-file file-name))))))
  (defun neo-buffer--insert-dir-entry (node depth expanded)
    (let ((node-short-name (neo-path--file-short-name node)))
      (insert-char ?\s (* (- depth 1) 2)) ; indent
      (when (memq 'char neo-vc-integration)
	(insert-char ?\s 2))
      (neo-buffer--insert-fold-symbol
       (if expanded 'open 'close) node)
      (insert-button (concat node-short-name "/")
		     'follow-link t
		     'face neo-dir-link-face
		     'neo-full-path node
		     'keymap neotree-dir-button-keymap)
      (neo-buffer--node-list-set nil node)
      (neo-buffer--newline-and-begin)))
  (defun neo-buffer--insert-file-entry (node depth)
    (let ((node-short-name (neo-path--file-short-name node))
	  (vc (when neo-vc-integration (neo-vc-for-node node))))
      (insert-char ?\s (* (- depth 1) 2)) ; indent
      (when (memq 'char neo-vc-integration)
	(insert-char (car vc))
	(insert-char ?\s))
      (neo-buffer--insert-fold-symbol 'leaf node-short-name)
      (insert-button node-short-name
		     'follow-link t
		     'face (if (memq 'face neo-vc-integration)
			       (cdr vc)
			     neo-file-link-face)
		     'neo-full-path node
		     'keymap neotree-file-button-keymap)
      (neo-buffer--node-list-set nil node)
      (neo-buffer--newline-and-begin)))
  :custom
  (neo-theme 'nerd2))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc754a88" class="outline-3">
<h3 id="orgc754a88"><span class="section-number-3">5.2</span> doom-theme</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; doom themes
(use-package doom-themes
  :custom
  (doom-themes-enable-italic t)
  (doom-themes-enable-bold t)
  :custom-face
  (doom-modeline-bar ((t (:background "#6272a4"))))
  :config
  (load-theme 'tango-dark t)
  (doom-themes-neotree-config)
  (doom-themes-org-config))

;; doom modeline
(use-package doom-modeline
  :custom
  (doom-modeline-buffer-file-name-style 'truncate-with-project)
  (doom-modeline-icon t)
  (doom-modeline-major-mode-icon nil)
  (doom-modeline-minor-modes nil)
  :hook
  (after-init . doom-modeline-mode)
  :config
  (line-number-mode 0)
  (column-number-mode 0))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org901d6cf" class="outline-2">
<h2 id="org901d6cf"><span class="section-number-2">6</span> Package</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org564222a" class="outline-3">
<h3 id="org564222a"><span class="section-number-3">6.1</span> hl-line</h3>
<div class="outline-text-3" id="text-6-1">
<p>
url: <a href="https://www.emacswiki.org/emacs/HighlightCurrentLine">https://www.emacswiki.org/emacs/HighlightCurrentLine</a>
</p>

<p>
現在の行をハイライトするパッケージ。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package hl-line
  :config
  (set-face-background 'hl-line "#444642")
  (set-face-attribute 'hl-line nil :inherit nil)
  (defvar global-hl-line-timer-exclude-modes '(todotxt-mode))
  (defun global-hl-line-timer-function ()
    (unless (memq major-mode global-hl-line-timer-exclude-modes)
      (global-hl-line-unhighlight-all)
      (let ((global-hl-line-mode t))
	(global-hl-line-highlight))))
  (setq global-hl-line-timer
	(run-with-idle-timer 0.03 t 'global-hl-line-timer-function)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec1b7c6" class="outline-3">
<h3 id="orgec1b7c6"><span class="section-number-3">6.2</span> hl-todo</h3>
<div class="outline-text-3" id="text-6-2">
<p>
url: <a href="http://emacs.rubikitch.com/hl-todo/">http://emacs.rubikitch.com/hl-todo/</a>
</p>

<p>
TODOやFIXMEなどのキーワードをハイライトするパッケージ。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package hl-todo
  :init
  (global-hl-todo-mode 1)
  :config
  (setq hl-todo-keyword-faces
	'(("HOLD" . "#d0bf8f")
	  ("TODO" . "#cc9393")
	  ("NEXT" . "#dca3a3")
	  ("THEM" . "#dc8cc3")
	  ("PROG" . "#7cb8bb")
	  ("OKAY" . "#7cb8bb")
	  ("DONT" . "#5f7f5f")
	  ("FAIL" . "#8c5353")
	  ("DONE" . "#afd8af")
	  ("FIXME" . "#cc9393")
	  ("???"   . "#cc9393"))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org9ca8837" class="outline-3">
<h3 id="org9ca8837"><span class="section-number-3">6.3</span> all-the-icons</h3>
<div class="outline-text-3" id="text-6-3">
<p>
url: <a href="https://github.com/domtronn/all-the-icons.el">https://github.com/domtronn/all-the-icons.el</a>
</p>

<p>
アイコンを追加するパッケージ。dired-mode時のみ有効にしている。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package all-the-icons
  :init
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org85f2915" class="outline-3">
<h3 id="org85f2915"><span class="section-number-3">6.4</span> all-the-icons-ivy</h3>
<div class="outline-text-3" id="text-6-4">
<p>
url: <a href="https://github.com/asok/all-the-icons-ivy">https://github.com/asok/all-the-icons-ivy</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package all-the-icons-ivy
  :config
  (all-the-icons-ivy-setup))
</pre>
</div>
</div>
</div>
<div id="outline-container-org30001be" class="outline-3">
<h3 id="org30001be"><span class="section-number-3">6.5</span> editorconfig</h3>
<div class="outline-text-3" id="text-6-5">
<p>
url: <a href="https://github.com/editorconfig/editorconfig-emacs">https://github.com/editorconfig/editorconfig-emacs</a>
</p>

<p>
editorconfigを有効にするパッケージ。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package editorconfig
  :config
  (editorconfig-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org94c39ff" class="outline-3">
<h3 id="org94c39ff"><span class="section-number-3">6.6</span> open-junk-file</h3>
<div class="outline-text-3" id="text-6-6">
<p>
url: <a href="https://www.emacswiki.org/emacs/open-junk-file.el">https://www.emacswiki.org/emacs/open-junk-file.el</a>
</p>

<p>
使い捨てファイルを作成するパッケージ。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package open-junk-file
  :config
  (setq open-junk-file-format "~/.emacs.d/.junk/%Y-%m%d-%H%M%S."))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec8b415" class="outline-3">
<h3 id="orgec8b415"><span class="section-number-3">6.7</span> smartrep/multiple-cursors</h3>
<div class="outline-text-3" id="text-6-7">
<p>
url: <a href="https://qiita.com/scalper/items/b9e357b3af071c930777">https://qiita.com/scalper/items/b9e357b3af071c930777</a>
</p>

<p>
複数cursorを便利に扱えるようにした。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package multiple-cursors
  :init
  (require 'smartrep)
  (declare-function smartrep-define-key "smartrep")
  (bind-key "C-M-c" 'mc/edit-lines)
  (bind-key "C-M-r" 'mc/mark-all-in-region)
  (global-unset-key (kbd "C-t"))
  (smartrep-define-key global-map "C-t"
    '(("C-t" . 'mc/mark-next-like-this)
      ("n"   . 'mc/mark-next-like-this)
      ("p"   . 'mc/mark-previous-like-this)
      ("m"   . 'mc/mark-more-like-this-extended)
      ("u"   . 'mc/unmark-next-like-this)
      ("U"   . 'mc/unmark-previous-like-this)
      ("s"   . 'mc/skip-to-next-like-this)
      ("S"   . 'mc/skip-to-previous-like-this)
      ("*"   . 'mc/mark-all-like-this)
      ("d"   . 'mc/mark-all-like-this-dwim)
      ("i"   . 'mc/insert-numbers)
      ("o"   . 'mc/sort-regions)
      ("O"   . 'mc/reverse-regions))))
</pre>
</div>
</div>
</div>
