index.org
** yasnippet
   url: [[https://github.com/joaotavora/yasnippet][https://github.com/joaotavora/yasnippet]]

   #+BEGIN_SRC emacs-lisp
     (use-package yasnippet
       :diminish yas-minor-mode)
     (use-package yasnippet-snippets
       :config
       (yas-global-mode 1))
   #+END_SRC
** counsel
   url: [[https://github.com/abo-abo/swiper][https://github.com/abo-abo/swiper]]
   #+BEGIN_SRC emacs-lisp
     (use-package counsel
       :config
       (setq ivy-use-virtual-buffers t)
       (setq counsel-ag-base-command "ag --nocolor --nogroup -u %s")
       (ivy-mode 1)
       (counsel-mode 1)
       (defun my/counsel-ag ()
         (interactive)
         (let ((symbol (thing-at-point 'symbol 'no-properties))
               (default-directory (locate-dominating-file default-directory ".git")))
           (counsel-ag symbol)))
       :bind
       (("C-x m" . counsel-compile)))
   #+END_SRC
** recentf
   url: [https://www.emacswiki.org/emacs/RecentFiles][https://www.emacswiki.org/emacs/RecentFiles]]
   #+BEGIN_SRC emacs-lisp
     (use-package recentf
       :config
       (setq recentf-max-saved-items 10000)
       (setq recentf-auto-cleanup 'never)
       (setq recentf-save-file "~/.emacs.d/.recentf")
       (setq recentf-exclude '(".recentf"))
       (recentf-mode 1))
   #+END_SRC
** magit
   url: [[https://www.emacswiki.org/emacs/Magit][https://www.emacswiki.org/emacs/Magit]]
   #+BEGIN_SRC emacs-lisp
     (use-package magit
       :ensure t)
   #+END_SRC
** ivy-rich
   url: [[https://github.com/Yevgnen/ivy-rich][https://github.com/Yevgnen/ivy-rich]]
   #+BEGIN_SRC emacs-lisp
     (use-package ivy-rich
       :config
       (ivy-rich-mode 1))
   #+END_SRC
** ace-window
   url: [[http://emacs.rubikitch.com/ace-window/][http://emacs.rubikitch.com/ace-window/]]
   #+BEGIN_SRC emacs-lisp
     (use-package ace-window
       :config
       (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
   #+END_SRC
** goto-addr
   url: [[https://www.emacswiki.org/emacs/GotoAddress][https://www.emacswiki.org/emacs/GotoAddress]]
   #+BEGIN_SRC emacs-lisp
     (use-package goto-addr
       :hook ((prog-mode . goto-address-prog-mode)(text-mode . goto-address-mode)))
   #+END_SRC
** swoop
   url: [[https://www.emacswiki.org/emacs/HelmSwoop][https://www.emacswiki.org/emacs/HelmSwoop]]
   #+BEGIN_SRC emacs-lisp
     (use-package swoop
       :config
       (setq swoop-minibuffer-input-dilay 0.4)
       (defun my/swoop-from-isearch ()
         (interactive)
         (let* ((symbol (thing-at-point 'symbol 'no-properties)))
           (swoop symbol))))

     (define-key ivy-mode-map (kbd "C-o") 'my/swoop-from-isearch)
   #+END_SRC
** whitespace
   url: [[https://www.emacswiki.org/emacs/WhiteSpace][https://www.emacswiki.org/emacs/WhiteSpace]]
   #+BEGIN_SRC emacs-lisp
     (use-package whitespace
       :config
       (setq whitespace-style '(face tabs tab-mark spaces space-mark))
       (setq whitespace-display-mappings
             '((space-mark ?\u3000 [?\u25a1])
               (tab-mark ?\t [?\xBB ?\t] [?\\ ?\t])))
       (setq whitespace-space-regexp "\\(\u3000+\\)")
       (set-face-foreground 'whitespace-tab "#adff2f")
       (set-face-background 'whitespace-tab 'nil)
       (set-face-underline  'whitespace-tab t)
       (set-face-foreground 'whitespace-space "#7cfc00")
       (set-face-background 'whitespace-space 'nil)
       (set-face-bold-p 'whitespace-space t)
       (global-whitespace-mode 1))
   #+END_SRC
** dashboard
   url: [[https://www-he.scphys.kyoto-u.ac.jp/member/shotakaha/dokuwiki/doku.php?id=toolbox:emacs:dashboard:start][https://www-he.scphys.kyoto-u.ac.jp/member/shotakaha/dokuwiki/doku.php?id=toolbox:emacs:dashboard:start]]
   #+BEGIN_SRC emacs-lisp
     (use-package dashboard
       :config
       (dashboard-setup-startup-hook))
   #+END_SRC
** company
   #+BEGIN_SRC emacs-lisp
     (use-package company
       :init
       (global-company-mode)
       :config
       (define-key company-active-map (kbd "C-n") 'company-select-next)
       (define-key company-active-map (kbd "C-p") 'company-select-previous))

     (use-package company-glsl
       :config
       (add-to-list 'company-backends 'company-glsl))
   #+END_SRC
** git-gutter
   #+BEGIN_SRC emacs-lisp
     (use-package git-gutter-fringe
       :config
       (global-git-gutter-mode +1))
   #+END_SRC
** smooth-scroll
   #+BEGIN_SRC emacs-lisp
     (use-package smooth-scroll
       :config
       (smooth-scroll-mode t))
   #+END_SRC
** exec-path-from-shell
   #+BEGIN_SRC emacs-lisp
     (defun my-exec-path-from-shell-initialize ()
       (when (memq window-system '(mac ns x))
         (exec-path-from-shell-copy-envs '("PATH" "GEM_HOME" "GOPATH"))
         (exec-path-from-shell-initialize)))

     (use-package exec-path-from-shell
       :init
       (add-hook 'after-init-hook 'my-exec-path-from-shell-initialize))
   #+END_SRC
** hindent
   #+BEGIN_SRC emacs-lisp
     (use-package hindent
       :init
       (add-hook 'haskell-mode-hook #'hindent-mode)
       :config
       (setq hindent-style "johan-tibell"))
   #+END_SRC
** tide
   #+BEGIN_SRC emacs-lisp
     (use-package tide
       :ensure t
       :init
       (defun my/setup-tide-mode ()
         (interactive)
         (tide-setup)
         (tide-hl-identifier-mode +1))
       (add-hook 'typescript-mode-hook #'my/setup-tide-mode))
   #+END_SRC
** ivy-ghq
   #+BEGIN_SRC emacs-lisp
     (use-package ivy-ghq
       :commands (ivy-ghq-open)
       :bind
       ("M-o" . ivy-ghq-open-and-fzf)
       :custom
       (ivy-ghq-short-list t)
       :preface
       (defun ivy-ghq-open-and-fzf ()
         (interactive)
         (ivy-ghq-open)
         (counsel-fzf)))
   #+END_SRC
** vterm
  #+BEGIN_SRC emacs-lisp
    ;; (use-package vterm
    ;;   :init
    ;;   (add-hook 'vterm-mode-hook #'(lambda ()
    ;;                                  (setq show-trailing-whitespace nil)))
    ;;   :bind (([mouse-1] . nil)
    ;;          ([mouse-2] . nil)
    ;;          ([mouse-3] . nil)
    ;;          ([mouse-4] . nil)
    ;;          ([mouse-5] . nil)))
  #+END_SRC
