index.html
<div id="outline-container-orgd004e35" class="outline-3">
<h3 id="orgd004e35"><span class="section-number-3">6.8</span> yasnippet</h3>
<div class="outline-text-3" id="text-6-8">
<p>
url: <a href="https://github.com/joaotavora/yasnippet">https://github.com/joaotavora/yasnippet</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package yasnippet
  :diminish yas-minor-mode)
(use-package yasnippet-snippets
  :config
  (yas-global-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org98e2ec5" class="outline-3">
<h3 id="org98e2ec5"><span class="section-number-3">6.9</span> counsel</h3>
<div class="outline-text-3" id="text-6-9">
<p>
url: <a href="https://github.com/abo-abo/swiper">https://github.com/abo-abo/swiper</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package counsel
  :config
  (setq ivy-use-virtual-buffers t)
  (setq counsel-ag-base-command "ag --nocolor --nogroup -u %s")
  (ivy-mode 1)
  (counsel-mode 1)
  (defun my/counsel-ag ()
    (interactive)
    (let ((symbol (thing-at-point 'symbol 'no-properties))
	  (default-directory (locate-dominating-file default-directory ".git")))
      (counsel-ag symbol)))
  :bind
  (("C-x m" . counsel-compile)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8af721a" class="outline-3">
<h3 id="org8af721a"><span class="section-number-3">6.10</span> recentf</h3>
<div class="outline-text-3" id="text-6-10">
<p>
url: [<a href="https://www.emacswiki.org/emacs/RecentFiles">https://www.emacswiki.org/emacs/RecentFiles</a>][<a href="https://www.emacswiki.org/emacs/RecentFiles">https://www.emacswiki.org/emacs/RecentFiles</a>]]
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package recentf
  :config
  (setq recentf-max-saved-items 10000)
  (setq recentf-auto-cleanup 'never)
  (setq recentf-save-file "~/.emacs.d/.recentf")
  (setq recentf-exclude '(".recentf"))
  (recentf-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a9c623" class="outline-3">
<h3 id="org5a9c623"><span class="section-number-3">6.11</span> magit</h3>
<div class="outline-text-3" id="text-6-11">
<p>
url: <a href="https://www.emacswiki.org/emacs/Magit">https://www.emacswiki.org/emacs/Magit</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package magit
  :ensure t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e30c73" class="outline-3">
<h3 id="org6e30c73"><span class="section-number-3">6.12</span> ivy-rich</h3>
<div class="outline-text-3" id="text-6-12">
<p>
url: <a href="https://github.com/Yevgnen/ivy-rich">https://github.com/Yevgnen/ivy-rich</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy-rich
  :config
  (ivy-rich-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8a04512" class="outline-3">
<h3 id="org8a04512"><span class="section-number-3">6.13</span> ace-window</h3>
<div class="outline-text-3" id="text-6-13">
<p>
url: <a href="http://emacs.rubikitch.com/ace-window/">http://emacs.rubikitch.com/ace-window/</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ace-window
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3fc6440" class="outline-3">
<h3 id="org3fc6440"><span class="section-number-3">6.14</span> goto-addr</h3>
<div class="outline-text-3" id="text-6-14">
<p>
url: <a href="https://www.emacswiki.org/emacs/GotoAddress">https://www.emacswiki.org/emacs/GotoAddress</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package goto-addr
  :hook ((prog-mode . goto-address-prog-mode)(text-mode . goto-address-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a925ba" class="outline-3">
<h3 id="org5a925ba"><span class="section-number-3">6.15</span> swoop</h3>
<div class="outline-text-3" id="text-6-15">
<p>
url: <a href="https://www.emacswiki.org/emacs/HelmSwoop">https://www.emacswiki.org/emacs/HelmSwoop</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package swoop
  :config
  (setq swoop-minibuffer-input-dilay 0.4)
  (defun my/swoop-from-isearch ()
    (interactive)
    (let* ((symbol (thing-at-point 'symbol 'no-properties)))
      (swoop symbol))))

(define-key ivy-mode-map (kbd "C-o") 'my/swoop-from-isearch)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc807846" class="outline-3">
<h3 id="orgc807846"><span class="section-number-3">6.16</span> whitespace</h3>
<div class="outline-text-3" id="text-6-16">
<p>
url: <a href="https://www.emacswiki.org/emacs/WhiteSpace">https://www.emacswiki.org/emacs/WhiteSpace</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package whitespace
  :config
  (setq whitespace-style '(face tabs tab-mark spaces space-mark))
  (setq whitespace-display-mappings
	'((space-mark ?\u3000 [?\u25a1])
	  (tab-mark ?\t [?\xBB ?\t] [?\\ ?\t])))
  (setq whitespace-space-regexp "\\(\u3000+\\)")
  (set-face-foreground 'whitespace-tab "#adff2f")
  (set-face-background 'whitespace-tab 'nil)
  (set-face-underline  'whitespace-tab t)
  (set-face-foreground 'whitespace-space "#7cfc00")
  (set-face-background 'whitespace-space 'nil)
  (set-face-bold-p 'whitespace-space t)
  (global-whitespace-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgee8b621" class="outline-3">
<h3 id="orgee8b621"><span class="section-number-3">6.17</span> dashboard</h3>
<div class="outline-text-3" id="text-6-17">
<p>
url: <a href="https://www-he.scphys.kyoto-u.ac.jp/member/shotakaha/dokuwiki/doku.php?id=toolbox:emacs:dashboard:start">https://www-he.scphys.kyoto-u.ac.jp/member/shotakaha/dokuwiki/doku.php?id=toolbox:emacs:dashboard:start</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dashboard
  :config
  (dashboard-setup-startup-hook))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb6656c2" class="outline-3">
<h3 id="orgb6656c2"><span class="section-number-3">6.18</span> company</h3>
<div class="outline-text-3" id="text-6-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package company
  :init
  (global-company-mode)
  :config
  (define-key company-active-map (kbd "C-n") 'company-select-next)
  (define-key company-active-map (kbd "C-p") 'company-select-previous))

(use-package company-glsl
  :config
  (add-to-list 'company-backends 'company-glsl))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe771bf" class="outline-3">
<h3 id="orgfe771bf"><span class="section-number-3">6.19</span> git-gutter</h3>
<div class="outline-text-3" id="text-6-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package git-gutter-fringe
  :config
  (global-git-gutter-mode +1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org14233ad" class="outline-3">
<h3 id="org14233ad"><span class="section-number-3">6.20</span> smooth-scroll</h3>
<div class="outline-text-3" id="text-6-20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package smooth-scroll
  :config
  (smooth-scroll-mode t))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc1ca1a2" class="outline-3">
<h3 id="orgc1ca1a2"><span class="section-number-3">6.21</span> exec-path-from-shell</h3>
<div class="outline-text-3" id="text-6-21">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my-exec-path-from-shell-initialize ()
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-copy-envs '("PATH" "GEM_HOME" "GOPATH"))
    (exec-path-from-shell-initialize)))

(use-package exec-path-from-shell
  :init
  (add-hook 'after-init-hook 'my-exec-path-from-shell-initialize))
</pre>
</div>
</div>
</div>
<div id="outline-container-org979f013" class="outline-3">
<h3 id="org979f013"><span class="section-number-3">6.22</span> hindent</h3>
<div class="outline-text-3" id="text-6-22">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package hindent
  :init
  (add-hook 'haskell-mode-hook #'hindent-mode)
  :config
  (setq hindent-style "johan-tibell"))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3366eb8" class="outline-3">
<h3 id="org3366eb8"><span class="section-number-3">6.23</span> tide</h3>
<div class="outline-text-3" id="text-6-23">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package tide
  :ensure t
  :init
  (defun my/setup-tide-mode ()
    (interactive)
    (tide-setup)
    (tide-hl-identifier-mode +1))
  (add-hook 'typescript-mode-hook #'my/setup-tide-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org787c5fc" class="outline-3">
<h3 id="org787c5fc"><span class="section-number-3">6.24</span> ivy-ghq</h3>
<div class="outline-text-3" id="text-6-24">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy-ghq
  :commands (ivy-ghq-open)
  :bind
  ("M-o" . ivy-ghq-open-and-fzf)
  :custom
  (ivy-ghq-short-list t)
  :preface
  (defun ivy-ghq-open-and-fzf ()
    (interactive)
    (ivy-ghq-open)
    (counsel-fzf)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge921ddf" class="outline-3">
<h3 id="orge921ddf"><span class="section-number-3">6.25</span> vterm</h3>
<div class="outline-text-3" id="text-6-25">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; (use-package vterm
;;   :init
;;   (add-hook 'vterm-mode-hook #'(lambda ()
;;                                  (setq show-trailing-whitespace nil)))
;;   :bind (([mouse-1] . nil)
;;          ([mouse-2] . nil)
;;          ([mouse-3] . nil)
;;          ([mouse-4] . nil)
;;          ([mouse-5] . nil)))
</pre>
</div>
</div>
</div>
