index.org
** omnisharp
   #+BEGIN_SRC emacs-lisp
     (use-package omnisharp
       :ensure t
       :init
       (add-hook 'csharp-mode-hook 'omnisharp-mode)
       (add-hook 'csharp-mode-hook #'flycheck-mode)
       ;; :bind ("." . 'omnisharp-add-dot-and-auto-complete)
       :config
       (add-to-list 'company-backends 'company-omnisharp))
   #+END_SRC
** nameless
   #+BEGIN_SRC emacs-lisp
     (use-package nameless
       :init
       (add-hook 'emacs-lisp-mode-hook 'nameless-mode))
   #+END_SRC
** esup
   #+BEGIN_SRC emacs-lisp
     (use-package esup
       :ensure t)
   #+END_SRC
** robe
   #+begin_src emacs-lisp
     (use-package robe
       :init
       (add-hook 'ruby-mode-hook 'robe-mode)
       :config
       (push 'company-robe company-backends))
   #+end_src
** rubocop
   #+begin_src emacs-lisp
     (use-package rubocop
       :init
       (add-hook 'ruby-mode-hook 'rubocop-mode))
   #+end_src
** flycheck
   #+begin_src emacs-lisp
     (use-package flycheck
       :init
       (add-hook 'ruby-mode-hook 'flycheck-mode)
       (add-hook 'ruby-mode-hook
                 '(lambda ()
                    (setq flycheck-checker 'ruby-rubocop)))
       :config
       (flycheck-define-checker ruby-rubocop
         "A Ruby syntax and style checker using the RuboCop tool."
         :command ("rubocop" "--format" "emacs"
                   (config-file "--config" flycheck-rubocoprc)
                   source)
         :error-patterns
         ((warning line-start
                   (file-name) ":" line ":" column ": " (or "C" "W") ": " (message)
                   line-end)
          (error line-start
                 (file-name) ":" line ":" column ": " (or "E" "F") ": " (message)
                 line-end))
         :modes (ruby-mode motion-mode))
       (setq flycheck-check-syntax-automatically '(mode-enabled save)))
   #+end_src
** helpful
   #+BEGIN_SRC emacs-lisp
     (use-package helpful
       :bind
       (("C-? f" . #'helpful-callable)
        ("C-? v" . #'helpful-variable)
        ("C-? k" . #'helpful-key)
        ("C-c C-d" . #'helpful-at-point)
        ("C-? F" . #'helpful-function)
        ("C-? C" . #'helpful-command))
       :config
       (setq counsel-describe-function-function #'helpful-callable)
       (setq counsel-describe-variable-function #'helpful-variable))
   #+END_SRC
** sql-indent
   #+BEGIN_SRC emacs-lisp
     (use-package sql-indent
       :init
       (add-hook 'sql-mode-hook 'sqlind-minor-mode))
   #+END_SRC
** aweshell
   #+BEGIN_SRC emacs-lisp
     (use-package aweshell)
   #+END_SRC
** racer
   #+BEGIN_SRC emacs-lisp
     (use-package racer
       :init
       (add-hook 'rust-mode-hook #'racer-mode)
       (add-hook 'racer-mode-hook #'eldoc-mode))
   #+END_SRC
** rastic
   #+BEGIN_SRC emacs-lisp
     (use-package rustic
       :init
       (add-hook 'rust-mode-hook #'rustic-mode)
       (add-hook 'rustic-mode-hook #'eldoc-mode))
   #+END_SRC
* Lisp
** slime
   #+BEGIN_SRC emacs-lisp
     (with-eval-after-load 'slime
       ;; (load (expand-file-name "~/quicklisp/slime-helper.el"))
       ;; (setq inferior-lisp-program "sbcl")
       (load (expand-file-name "~/.roswell/helper.el"))
       (add-hook 'slime-mode-hook 'set-up-slime-ac)
       (add-hook 'slime-repl-mode-hook 'set-up-slime-ac)
       (define-key slime-repl-mode-map (kbd "C-c C-r") 'my/slime-history))
   #+END_SRC
** paredit
   #+BEGIN_SRC emacs-lisp
     (use-package paredit
       :config
       (autoload 'enable-paredit-mode "paredit" t)
       (add-hook 'emacs-lisp-mode-hook 'enable-paredit-mode)
       (add-hook 'lisp-mode-hook 'enable-paredit-mode)
       (add-hook 'lisp-interaction-mode-hook 'enable-paredit-mode)
       (add-hook 'scheme-mode-hook 'enable-paredit-mode)
       (eval-after-load "paredit"
         #'(define-key paredit-mode-map (kbd "C-c f") 'paredit-forward-slurp-sexp))
       (eval-after-load "paredit"
         #'(define-key paredit-mode-map (kbd "C-c b") 'paredit-forward-barf-sexp)))
   #+END_SRC
** hyperspec
   #+BEGIN_SRC emacs-lisp
     (setq common-lisp-hyperspec-root "~/.roswell/HyperSpec/")

     (defun common-lisp-hyperspec (symbol-name)
         (interactive (list (common-lisp-hyperspec-read-symbol-name)))
         (let ((name (common-lisp-hyperspec--strip-cl-package
                         (downcase symbol-name))))
             (cl-maplist (lambda (entry)
                             (eww-open-file (concat common-lisp-hyperspec-root "Body/"
                                                (car entry)))
                             (when (cdr entry)
                                 (sleep-for 1.5)))
                 (or (common-lisp-hyperspec--find name)
                     (error "The symbol `%s' is not defined in Common Lisp"
                         symbol-name)))))

     (defun common-lisp-hyperspec-lookup-reader-macro (macro)
       (interactive
        (list
         (let ((completion-ignore-case t))
           (completing-read "Look up reader-macro: "
                            common-lisp-hyperspec--reader-macros nil t
                            (common-lisp-hyperspec-reader-macro-at-point)))))
       (eww-open-file
        (concat common-lisp-hyperspec-root "Body/"
                (gethash macro common-lisp-hyperspec--reader-macros))))

     (defun common-lisp-hyperspec-format (character-name)
       (interactive (list (common-lisp-hyperspec--read-format-character)))
       (cl-maplist (lambda (entry)
                     (eww-open-file (common-lisp-hyperspec-section (car entry))))
                   (or (gethash character-name
                                common-lisp-hyperspec--format-characters)
                       (error "The symbol `%s' is not defined in Common Lisp"
                              character-name))))

     (defadvice common-lisp-hyperspec (around common-lisp-hyperspec-around activate)
       (let ((buf (current-buffer)))
         ad-do-it
         (switch-to-buffer buf)
         (pop-to-buffer "*eww*")))

     (defadvice common-lisp-hyperspec-lookup-reader-macro (around common-lisp-hyperspec-lookup-reader-macro-around activate)
       (let ((buf (current-buffer)))
         ad-do-it
         (switch-to-buffer buf)
         (pop-to-buffer "*eww*")))

     (defadvice common-lisp-hyperspec-format (around common-lisp-hyperspec-format activate)
       (let ((buf (current-buffer)))
         ad-do-it
         (switch-to-buffer buf)
         (pop-to-buffer "*eww*")))
     (dolist (hook '(emacs-lisp-mode-hook
                     lisp-interaction-mode-hook
                     ielm-mode-hook))
       (add-hook hook 'elisp-slime-nav-mode))

     (define-key lisp-mode-map (kbd "C-c h") 'hyperspec-lookup)
   #+END_SRC
