index.html
<div id="outline-container-org898c3a8" class="outline-3">
<h3 id="org898c3a8"><span class="section-number-3">6.26</span> omnisharp</h3>
<div class="outline-text-3" id="text-6-26">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package omnisharp
  :ensure t
  :init
  (add-hook 'csharp-mode-hook 'omnisharp-mode)
  (add-hook 'csharp-mode-hook #'flycheck-mode)
  ;; :bind ("." . 'omnisharp-add-dot-and-auto-complete)
  :config
  (add-to-list 'company-backends 'company-omnisharp))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0832150" class="outline-3">
<h3 id="org0832150"><span class="section-number-3">6.27</span> nameless</h3>
<div class="outline-text-3" id="text-6-27">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package nameless
  :init
  (add-hook 'emacs-lisp-mode-hook 'nameless-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org47fe224" class="outline-3">
<h3 id="org47fe224"><span class="section-number-3">6.28</span> esup</h3>
<div class="outline-text-3" id="text-6-28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package esup
  :ensure t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfddc655" class="outline-3">
<h3 id="orgfddc655"><span class="section-number-3">6.29</span> robe</h3>
<div class="outline-text-3" id="text-6-29">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package robe
  :init
  (add-hook 'ruby-mode-hook 'robe-mode)
  :config
  (push 'company-robe company-backends))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5cb3a4" class="outline-3">
<h3 id="orgf5cb3a4"><span class="section-number-3">6.30</span> rubocop</h3>
<div class="outline-text-3" id="text-6-30">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rubocop
  :init
  (add-hook 'ruby-mode-hook 'rubocop-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3617edc" class="outline-3">
<h3 id="org3617edc"><span class="section-number-3">6.31</span> flycheck</h3>
<div class="outline-text-3" id="text-6-31">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package flycheck
  :init
  (add-hook 'ruby-mode-hook 'flycheck-mode)
  (add-hook 'ruby-mode-hook
	    '(lambda ()
	       (setq flycheck-checker 'ruby-rubocop)))
  :config
  (flycheck-define-checker ruby-rubocop
    "A Ruby syntax and style checker using the RuboCop tool."
    :command ("rubocop" "--format" "emacs"
	      (config-file "--config" flycheck-rubocoprc)
	      source)
    :error-patterns
    ((warning line-start
	      (file-name) ":" line ":" column ": " (or "C" "W") ": " (message)
	      line-end)
     (error line-start
	    (file-name) ":" line ":" column ": " (or "E" "F") ": " (message)
	    line-end))
    :modes (ruby-mode motion-mode))
  (setq flycheck-check-syntax-automatically '(mode-enabled save)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5fff30b" class="outline-3">
<h3 id="org5fff30b"><span class="section-number-3">6.32</span> helpful</h3>
<div class="outline-text-3" id="text-6-32">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package helpful
  :bind
  (("C-? f" . #'helpful-callable)
   ("C-? v" . #'helpful-variable)
   ("C-? k" . #'helpful-key)
   ("C-c C-d" . #'helpful-at-point)
   ("C-? F" . #'helpful-function)
   ("C-? C" . #'helpful-command))
  :config
  (setq counsel-describe-function-function #'helpful-callable)
  (setq counsel-describe-variable-function #'helpful-variable))
</pre>
</div>
</div>
</div>
<div id="outline-container-org91bf3a2" class="outline-3">
<h3 id="org91bf3a2"><span class="section-number-3">6.33</span> sql-indent</h3>
<div class="outline-text-3" id="text-6-33">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package sql-indent
  :init
  (add-hook 'sql-mode-hook 'sqlind-minor-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7798214" class="outline-3">
<h3 id="org7798214"><span class="section-number-3">6.34</span> aweshell</h3>
<div class="outline-text-3" id="text-6-34">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package aweshell)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c8c082" class="outline-3">
<h3 id="org0c8c082"><span class="section-number-3">6.35</span> racer</h3>
<div class="outline-text-3" id="text-6-35">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package racer
  :init
  (add-hook 'rust-mode-hook #'racer-mode)
  (add-hook 'racer-mode-hook #'eldoc-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2a1cee2" class="outline-3">
<h3 id="org2a1cee2"><span class="section-number-3">6.36</span> rastic</h3>
<div class="outline-text-3" id="text-6-36">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rustic
  :init
  (add-hook 'rust-mode-hook #'rustic-mode)
  (add-hook 'rustic-mode-hook #'eldoc-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcb19503" class="outline-2">
<h2 id="orgcb19503"><span class="section-number-2">7</span> Lisp</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgf787bfd" class="outline-3">
<h3 id="orgf787bfd"><span class="section-number-3">7.1</span> slime</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'slime
  ;; (load (expand-file-name "~/quicklisp/slime-helper.el"))
  ;; (setq inferior-lisp-program "sbcl")
  (load (expand-file-name "~/.roswell/helper.el"))
  (add-hook 'slime-mode-hook 'set-up-slime-ac)
  (add-hook 'slime-repl-mode-hook 'set-up-slime-ac)
  (define-key slime-repl-mode-map (kbd "C-c C-r") 'my/slime-history))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd31785f" class="outline-3">
<h3 id="orgd31785f"><span class="section-number-3">7.2</span> paredit</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package paredit
  :config
  (autoload 'enable-paredit-mode "paredit" t)
  (add-hook 'emacs-lisp-mode-hook 'enable-paredit-mode)
  (add-hook 'lisp-mode-hook 'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook 'enable-paredit-mode)
  (add-hook 'scheme-mode-hook 'enable-paredit-mode)
  (eval-after-load "paredit"
    #'(define-key paredit-mode-map (kbd "C-c f") 'paredit-forward-slurp-sexp))
  (eval-after-load "paredit"
    #'(define-key paredit-mode-map (kbd "C-c b") 'paredit-forward-barf-sexp)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5631885" class="outline-3">
<h3 id="org5631885"><span class="section-number-3">7.3</span> hyperspec</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq common-lisp-hyperspec-root "~/.roswell/HyperSpec/")

(defun common-lisp-hyperspec (symbol-name)
    (interactive (list (common-lisp-hyperspec-read-symbol-name)))
    (let ((name (common-lisp-hyperspec--strip-cl-package
		    (downcase symbol-name))))
	(cl-maplist (lambda (entry)
			(eww-open-file (concat common-lisp-hyperspec-root "Body/"
					   (car entry)))
			(when (cdr entry)
			    (sleep-for 1.5)))
	    (or (common-lisp-hyperspec--find name)
		(error "The symbol `%s' is not defined in Common Lisp"
		    symbol-name)))))

(defun common-lisp-hyperspec-lookup-reader-macro (macro)
  (interactive
   (list
    (let ((completion-ignore-case t))
      (completing-read "Look up reader-macro: "
		       common-lisp-hyperspec--reader-macros nil t
		       (common-lisp-hyperspec-reader-macro-at-point)))))
  (eww-open-file
   (concat common-lisp-hyperspec-root "Body/"
	   (gethash macro common-lisp-hyperspec--reader-macros))))

(defun common-lisp-hyperspec-format (character-name)
  (interactive (list (common-lisp-hyperspec--read-format-character)))
  (cl-maplist (lambda (entry)
		(eww-open-file (common-lisp-hyperspec-section (car entry))))
	      (or (gethash character-name
			   common-lisp-hyperspec--format-characters)
		  (error "The symbol `%s' is not defined in Common Lisp"
			 character-name))))

(defadvice common-lisp-hyperspec (around common-lisp-hyperspec-around activate)
  (let ((buf (current-buffer)))
    ad-do-it
    (switch-to-buffer buf)
    (pop-to-buffer "*eww*")))

(defadvice common-lisp-hyperspec-lookup-reader-macro (around common-lisp-hyperspec-lookup-reader-macro-around activate)
  (let ((buf (current-buffer)))
    ad-do-it
    (switch-to-buffer buf)
    (pop-to-buffer "*eww*")))

(defadvice common-lisp-hyperspec-format (around common-lisp-hyperspec-format activate)
  (let ((buf (current-buffer)))
    ad-do-it
    (switch-to-buffer buf)
    (pop-to-buffer "*eww*")))
(dolist (hook '(emacs-lisp-mode-hook
		lisp-interaction-mode-hook
		ielm-mode-hook))
  (add-hook hook 'elisp-slime-nav-mode))

(define-key lisp-mode-map (kbd "C-c h") 'hyperspec-lookup)
</pre>
</div>
</div>
</div>
