index.org
** rainbow-dpelimiters
   #+BEGIN_SRC emacs-lisp
     (use-package rainbow-delimiters
       :init
       (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
  #+END_SRC
** cider
   emacsからleiningenを扱えるようにするpackage
   公式document: [[https://docs.cider.mx/cider/index.html][https://docs.cider.mx/cider/index.html]]
   #+BEGIN_SRC emacs-lisp
     (use-package cider
       :ensure t)
   #+END_SRC
* LSP
** lsp-mode
   #+BEGIN_SRC emacs-lisp
     (use-package lsp-mode
       :ensure t)

     (dolist (hook '(go-mode-hook
                     lsp-deferred
                     js2-mode-hook
                     css-mode-hook
                     scss-mode-hook
                     haskell-mode-hook
                     typescript-mode-hook
                     java-mode-hook
                     vue-mode-hook
                     sh-mode-hook
                     shell-mode-hook
                     php-mode-hook
                     python-mode-hook))
       (add-hook hook #'lsp))
     (add-hook 'lsp-mode-hook 'flycheck-mode)

     (use-package lsp-java
       :ensure t)
     (use-package lsp-haskell
       :ensure t)
   #+END_SRC
** lsp-ui
   #+BEGIN_SRC emacs-lisp
     (use-package lsp-ui
       :ensure t
       :init
       (add-hook 'lsp-mode-hook 'lsp-ui-mode)
       :bind (("M-." . 'lsp-ui-peek-find-definitions)
              ("M-?" . 'lsp-ui-peek-find-implementation))
       :config
       (setq lsp-ui-doc-enable t)
       (setq lsp-ui-doc-max-height 15)
       (setq lsp-ui-sideline-enable nil)
       (setq lsp-ui-imenu-enable nil)
       (setq lsp-ui-sideline-enable nil))
   #+END_SRC
** company-lsp
   #+BEGIN_SRC emacs-lisp
     (use-package company-lsp
       :ensure t
       :config
       (push 'company-lsp company-backends))
   #+END_SRC
** dap-mode
   #+BEGIN_SRC emacs-lisp
     (use-package dap-mode
       :ensure t
       :bind
       (("C-c d" . 'dap-breakpoint-toggle))
       :config
       (dap-mode 1)
       (dap-ui-mode 1))
     ;; (use-package dap-php
     ;;   :ensure t
     ;; (use-package dap-node
     ;;   :ensure t
     ;; (use-package dap-ruby
     ;;   :ensure t
     ;; (use-package dap-chrome
     ;;   :ensure t
  #+END_SRC
* Mode
** fundamental-mode
   #+BEGIN_SRC emacs-lisp
     (add-to-list 'auto-mode-alist '("\\.elc$" . fundamental-mode))
   #+END_SRC
** ruby-mode
   #+BEGIN_SRC emacs-lisp
     (add-to-list 'auto-mode-alist '("Schemafile" . ruby-mode))
   #+END_SRC
** lisp-mode
   #+BEGIN_SRC emacs-lisp
     (add-to-list 'auto-mode-alist '("Cask" . lisp-mode))
     (add-to-list 'auto-mode-alist '("\\.lemrc?$" . lisp-mode))
   #+END_SRC
** web-mode
   #+BEGIN_SRC emacs-lisp
     (use-package web-mode
       :mode (("\\.html?\\'" . web-mode)
              ("\\.erb\\'" . web-mode)
              ("\\.gsp\\'" . web-mode)
              ("\\.tsx\\'" . web-mode))
       :init
       (add-hook 'web-mode-hook
                 (lambda ()
                   (when (string-equal "tsx" (file-name-extension buffer-file-name))
                     (my/setup-tide-mode))))
       :config
       (setq web-mode-auto-close-style t)
       (setq web-mode-tag-auto-close-style t))
   #+END_SRC
** go-mode
   #+BEGIN_SRC emacs-lisp
     (use-package go-mode
       :mode (("\\.go$" . go-mode)))
   #+END_SRC
** terraform-mode
   #+BEGIN_SRC emacs-lisp
     (use-package terraform-mode
       :mode (("\\.tf$" . terraform-mode)))
   #+END_SRC
** markdown-mode
   #+BEGIN_SRC emacs-lisp
     (use-package markdown-mode
       :mode (("\\.md$" . markdown-mode)
              ("\\.markdown$" . markdown-mode)))
   #+END_SRC
** yaml-mode
   #+BEGIN_SRC emacs-lisp
     (use-package yaml-mode
       :mode (("\\.ya?ml$" . yaml-mode)))
   #+END_SRC
** json-mode
   #+BEGIN_SRC emacs-lisp
     (use-package json-mode
       :mode (("\\.json$" . json-mode)))
   #+END_SRC
** dockerfile-mode
   #+BEGIN_SRC emacs-lisp
     (use-package dockerfile-mode
       :mode (("Dockerfile\\'" . dockerfile-mode)))
   #+END_SRC
** fish-mode
   #+BEGIN_SRC emacs-lisp
     (use-package fish-mode
       :mode (("\\.fish$" . fish-mode)))
   #+END_SRC
** dhall-mode
   #+BEGIN_SRC emacs-lisp
     (use-package dhall-mode
       :mode (("\\dhall$" . dhall-mode)))
   #+END_SRC
** js2-mode
   #+BEGIN_SRC emacs-lisp
     (use-package js2-mode
       :mode (("\\.js$" . js2-mode))
       :init
       (add-hook 'js2-mode-hook #'js2-refactor-mode)
       :config
       (setq js2-skip-preprocessor-directives t))
   #+END_SRC
** typescript-mode
   #+BEGIN_SRC emacs-lisp
     (use-package typescript-mode
       :mode (("\\.ts$" . typescript-mode)))
   #+END_SRC
** slim-mode
   #+BEGIN_SRC emacs-lisp
     (use-package slim-mode
       :mode (("\\.slim$" . slim-mode)))
   #+END_SRC
** coffee-mode
   #+BEGIN_SRC emacs-lisp
     (use-package coffee-mode
       :mode (("\\.coffee$" . coffee-mode)))
   #+END_SRC
** scala-mode
   #+BEGIN_SRC emacs-lisp
     (use-package scala-mode
       :mode (("\\.scala$" . scala-mode)))
   #+END_SRC
** nginx-mode
   #+BEGIN_SRC emacs-lisp
     (use-package nginx-mode
       :mode (("/nginx/sites-\\(?:available\\|enabled\\)/" . nginx-mode)))
   #+END_SRC
** ssh-config-mode
   #+BEGIN_SRC emacs-lisp
     (use-package ssh-config-mode
       :mode (("/path-to-your-ssh/config\\$" . ssh-config-mode)))
   #+END_SRC
