index.html
<div id="outline-container-org39894a3" class="outline-3">
<h3 id="org39894a3"><span class="section-number-3">7.4</span> rainbow-dpelimiters</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-delimiters
  :init
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org565c84e" class="outline-3">
<h3 id="org565c84e"><span class="section-number-3">7.5</span> cider</h3>
<div class="outline-text-3" id="text-7-5">
<p>
emacsからleiningenを扱えるようにするpackage
公式document: <a href="https://docs.cider.mx/cider/index.html">https://docs.cider.mx/cider/index.html</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package cider
  :ensure t)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6a2fa5f" class="outline-2">
<h2 id="org6a2fa5f"><span class="section-number-2">8</span> LSP</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgc5a087c" class="outline-3">
<h3 id="orgc5a087c"><span class="section-number-3">8.1</span> lsp-mode</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-mode
  :ensure t)

(dolist (hook '(go-mode-hook
		lsp-deferred
		js2-mode-hook
		css-mode-hook
		scss-mode-hook
		haskell-mode-hook
		typescript-mode-hook
		java-mode-hook
		vue-mode-hook
		sh-mode-hook
		shell-mode-hook
		php-mode-hook
		python-mode-hook))
  (add-hook hook #'lsp))
(add-hook 'lsp-mode-hook 'flycheck-mode)

(use-package lsp-java
  :ensure t)
(use-package lsp-haskell
  :ensure t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge7d3844" class="outline-3">
<h3 id="orge7d3844"><span class="section-number-3">8.2</span> lsp-ui</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-ui
  :ensure t
  :init
  (add-hook 'lsp-mode-hook 'lsp-ui-mode)
  :bind (("M-." . 'lsp-ui-peek-find-definitions)
	 ("M-?" . 'lsp-ui-peek-find-implementation))
  :config
  (setq lsp-ui-doc-enable t)
  (setq lsp-ui-doc-max-height 15)
  (setq lsp-ui-sideline-enable nil)
  (setq lsp-ui-imenu-enable nil)
  (setq lsp-ui-sideline-enable nil))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6b147c7" class="outline-3">
<h3 id="org6b147c7"><span class="section-number-3">8.3</span> company-lsp</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package company-lsp
  :ensure t
  :config
  (push 'company-lsp company-backends))
</pre>
</div>
</div>
</div>
<div id="outline-container-orged2a7b2" class="outline-3">
<h3 id="orged2a7b2"><span class="section-number-3">8.4</span> dap-mode</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dap-mode
  :ensure t
  :bind
  (("C-c d" . 'dap-breakpoint-toggle))
  :config
  (dap-mode 1)
  (dap-ui-mode 1))
;; (use-package dap-php
;;   :ensure t
;; (use-package dap-node
;;   :ensure t
;; (use-package dap-ruby
;;   :ensure t
;; (use-package dap-chrome
;;   :ensure t
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org427d05b" class="outline-2">
<h2 id="org427d05b"><span class="section-number-2">9</span> Mode</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgc5ad6f2" class="outline-3">
<h3 id="orgc5ad6f2"><span class="section-number-3">9.1</span> fundamental-mode</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '("\\.elc$" . fundamental-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e2322b" class="outline-3">
<h3 id="org2e2322b"><span class="section-number-3">9.2</span> ruby-mode</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '("Schemafile" . ruby-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf9a8da" class="outline-3">
<h3 id="orgcf9a8da"><span class="section-number-3">9.3</span> lisp-mode</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '("Cask" . lisp-mode))
(add-to-list 'auto-mode-alist '("\\.lemrc?$" . lisp-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org29a5f30" class="outline-3">
<h3 id="org29a5f30"><span class="section-number-3">9.4</span> web-mode</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package web-mode
  :mode (("\\.html?\\'" . web-mode)
	 ("\\.erb\\'" . web-mode)
	 ("\\.gsp\\'" . web-mode)
	 ("\\.tsx\\'" . web-mode))
  :init
  (add-hook 'web-mode-hook
	    (lambda ()
	      (when (string-equal "tsx" (file-name-extension buffer-file-name))
		(my/setup-tide-mode))))
  :config
  (setq web-mode-auto-close-style t)
  (setq web-mode-tag-auto-close-style t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4dbfe7c" class="outline-3">
<h3 id="org4dbfe7c"><span class="section-number-3">9.5</span> go-mode</h3>
<div class="outline-text-3" id="text-9-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package go-mode
  :mode (("\\.go$" . go-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgacd14a3" class="outline-3">
<h3 id="orgacd14a3"><span class="section-number-3">9.6</span> terraform-mode</h3>
<div class="outline-text-3" id="text-9-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package terraform-mode
  :mode (("\\.tf$" . terraform-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org979a13a" class="outline-3">
<h3 id="org979a13a"><span class="section-number-3">9.7</span> markdown-mode</h3>
<div class="outline-text-3" id="text-9-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package markdown-mode
  :mode (("\\.md$" . markdown-mode)
	 ("\\.markdown$" . markdown-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4d195e" class="outline-3">
<h3 id="orgf4d195e"><span class="section-number-3">9.8</span> yaml-mode</h3>
<div class="outline-text-3" id="text-9-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package yaml-mode
  :mode (("\\.ya?ml$" . yaml-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd7f2c3f" class="outline-3">
<h3 id="orgd7f2c3f"><span class="section-number-3">9.9</span> json-mode</h3>
<div class="outline-text-3" id="text-9-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package json-mode
  :mode (("\\.json$" . json-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf8b592d" class="outline-3">
<h3 id="orgf8b592d"><span class="section-number-3">9.10</span> dockerfile-mode</h3>
<div class="outline-text-3" id="text-9-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dockerfile-mode
  :mode (("Dockerfile\\'" . dockerfile-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd217ffc" class="outline-3">
<h3 id="orgd217ffc"><span class="section-number-3">9.11</span> fish-mode</h3>
<div class="outline-text-3" id="text-9-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package fish-mode
  :mode (("\\.fish$" . fish-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4264cdd" class="outline-3">
<h3 id="org4264cdd"><span class="section-number-3">9.12</span> dhall-mode</h3>
<div class="outline-text-3" id="text-9-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dhall-mode
  :mode (("\\dhall$" . dhall-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e3c970" class="outline-3">
<h3 id="org2e3c970"><span class="section-number-3">9.13</span> js2-mode</h3>
<div class="outline-text-3" id="text-9-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package js2-mode
  :mode (("\\.js$" . js2-mode))
  :init
  (add-hook 'js2-mode-hook #'js2-refactor-mode)
  :config
  (setq js2-skip-preprocessor-directives t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org53a7051" class="outline-3">
<h3 id="org53a7051"><span class="section-number-3">9.14</span> typescript-mode</h3>
<div class="outline-text-3" id="text-9-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package typescript-mode
  :mode (("\\.ts$" . typescript-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc63ebdd" class="outline-3">
<h3 id="orgc63ebdd"><span class="section-number-3">9.15</span> slim-mode</h3>
<div class="outline-text-3" id="text-9-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package slim-mode
  :mode (("\\.slim$" . slim-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1ea90b2" class="outline-3">
<h3 id="org1ea90b2"><span class="section-number-3">9.16</span> coffee-mode</h3>
<div class="outline-text-3" id="text-9-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package coffee-mode
  :mode (("\\.coffee$" . coffee-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf64e681" class="outline-3">
<h3 id="orgf64e681"><span class="section-number-3">9.17</span> scala-mode</h3>
<div class="outline-text-3" id="text-9-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package scala-mode
  :mode (("\\.scala$" . scala-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5f48579" class="outline-3">
<h3 id="org5f48579"><span class="section-number-3">9.18</span> nginx-mode</h3>
<div class="outline-text-3" id="text-9-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package nginx-mode
  :mode (("/nginx/sites-\\(?:available\\|enabled\\)/" . nginx-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org40f2e06" class="outline-3">
<h3 id="org40f2e06"><span class="section-number-3">9.19</span> ssh-config-mode</h3>
<div class="outline-text-3" id="text-9-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ssh-config-mode
  :mode (("/path-to-your-ssh/config\\$" . ssh-config-mode)))
</pre>
</div>
</div>
</div>
