index.org
** php-mode
   #+BEGIN_SRC emacs-lisp
     (use-package php-mode
       :mode (("\\.php$" . php-mode)))
   #+END_SRC
** clojure-mode
   #+BEGIN_SRC emacs-lisp
     (use-package clojure-mode
       :mode (("\\.clj$" . clojure-mode)
              ("\\.cljs$" . clojurescript-mode)))
   #+END_SRC
** vue-mode
   #+BEGIN_SRC emacs-lisp
     (use-package vue-mode
       :mode (("\\.vue$" . vue-mode))
       :config
       (setq mmm-js-mode-enter-hook (lambda () (setq syntax-ppss-table nil)))
       (setq mmm-typescript-mode-enter-hook (lambda () (setq syntax-ppss-table nil)))
       (setq indent-tabs-mode nil
             js-indent-level 2))
   #+END_SRC
** glsl-mode
   #+BEGIN_SRC emacs-lisp
     (use-package glsl-mode
       :mode (("\\.vsh$" . glsl-mode)
              ("\\.fsh$" . glsl-mode)))
   #+END_SRC
** emmet-mode
   #+BEGIN_SRC emacs-lisp
     (use-package emmet-mode
       :init
       (add-hook 'web-mode-hook 'emmet-mode)
       (add-hook 'vue-mode 'emmet-mode)
       :config
       (define-key emmet-mode-keymap (kbd "C-j") nil))
   #+END_SRC
** nyan-mode
   #+BEGIN_SRC emacs-lisp
     (use-package nyan-mode
       :init
       (nyan-mode)
       (nyan-start-animation)
       :config
       (setq nyan-wavy-trail t))
   #+END_SRC
** haskell-mode
   #+BEGIN_SRC emacs-lisp
     (use-package haskell-mode
       :mode (("\\.hs$" . haskell-mode)
              ("\\.lhs$" . literate-haskell-mode)
              ("\\.cable$" . haskell-cabal-mode))
       :bind (("C-m" . nil)))
   #+END_SRC
** gradle-mode
   #+BEGIN_SRC emacs-lisp
     (use-package gradle-mode
       :mode (("\\.gradle$" . java-mode)))
   #+END_SRC
** cmake-mode
   #+BEGIN_SRC emacs-lisp
     (use-package cmake-mode
       :mode (("\\.cmake$" . cmake-mode)))
   #+END_SRC
** toml-mode
   #+BEGIN_SRC emacs-lisp
     (use-package toml-mode
       :mode (("\\.toml$" . toml-mode)))
   #+END_SRC
** gitignore-mode
   #+BEGIN_SRC emacs-lisp
     (use-package gitignore-mode
       :mode (("\\.dockerignore$" . gitignore-mode)))
   #+END_SRC
** plantuml-mode
   #+BEGIN_SRC emacs-lisp
     (use-package plantuml-mode
       :mode (("\\.pu$" . plantuml-mode)))
   #+END_SRC
** processing-mode
   #+BEGIN_SRC emacs-lisp
     (use-package processing-mode
       :mode (("\\.pde$" . processing-mode))
       :config
       (setq processing-location "/opt/processing/processing-java")
       (setq processing-output-dir "/tmp"))
  #+END_SRC
** csharp-mode
   #+BEGIN_SRC emacs-lisp
     (use-package csharp-mode
       :mode (("\\.cs$" . csharp-mode)))
   #+END_SRC
** docker-compose-mode
   #+begin_src emacs-lisp
     (use-package docker-compose-mode
       :mode (("docker-compose*" . docker-compose-mode)))
   #+end_src
** rust-mode
   #+BEGIN_SRC emacs-lisp
     (use-package rust-mode
       :mode (("\\.rs$" . rust-mode)))
   #+END_SRC
* Refactor
** emr
   #+BEGIN_SRC emacs-lisp
     (use-package emr
       :bind (("M-RET" . 'emr-show-refactor-menu)))
   #+END_SRC
** js2-refactor
   #+BEGIN_SRC emacs-lisp
     (use-package js2-refactor
       :ensure t
       :init
       (add-hook 'js2-mode-hook #'js2-refactor-mode)
       (add-hook 'typescript-mode-hook #'js2-refactor-mode)
       :config
       (js2r-add-keybindings-with-prefix "C-c C-m"))
   #+END_SRC
** ruby-refactor
   #+BEGIN_SRC emacs-lisp
     (use-package ruby-refactor
       :ensure t
       :init
       (add-hook 'ruby-mode-hook 'ruby-refactor-mode-launch))
   #+END_SRC
* MyFunc
** my/beginning-of-intendation
   #+BEGIN_SRC emacs-lisp
     (defun my/beginning-of-intendation ()
       "move to beginning of line, or indentation"
       (interactive)
       (back-to-indentation))
   #+END_SRC
** my/ido-recentf
   #+BEGIN_SRC emacs-lisp
     (defun my/ido-recentf ()
       (interactive)
       (find-file (ido-completing-read "Find recent file: " recentf-list)))
   #+END_SRC
** my/suspend
   #+BEGIN_SRC emacs-lisp
     (defun my/suspend ()
       (interactive)
       (shell-command-to-string "systemctl suspend"))
   #+END_SRC
** my/counsel-fd
   #+BEGIN_SRC emacs-lisp
     (defun my/counsel-fd ()
       (interactive)
       (let* ((current-directory (file-name-directory (or buffer-file-name default-directory)))
              (default-directory (expand-file-name (or (locate-dominating-file default-directory ".git")
                                                       current-directory)))
              (files (split-string (shell-command-to-string "fd -L -I --hidden -a --color never"))))
         (ivy-read "Choose: " files
                   :action (lambda (x)
                             (let ((expanded-name (expand-file-name x)))
                               (if (file-directory-p expanded-name)
                                   (counsel-find-file (concat expanded-name "/"))
                                 (find-file expanded-name))))
                   :caller 'my/counsel-fd)))
   #+END_SRC
** my/before-set-auto-mode
   #+BEGIN_SRC emacs-lisp
     (defun my/before-set-auto-mode ()
       (when (or (and buffer-file-name
                      (> (file-attribute-size (file-attributes buffer-file-name)) 100000))
                 (> (line-number-at-pos (point-max)) 10000))
         (prog1 t
           (prog-mode))))

     (advice-add 'set-auto-mode :before-until 'my/before-set-auto-mode)
   #+END_SRC
