index.html
<div id="outline-container-orge76629b" class="outline-3">
<h3 id="orge76629b"><span class="section-number-3">9.20</span> php-mode</h3>
<div class="outline-text-3" id="text-9-20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package php-mode
  :mode (("\\.php$" . php-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c01e03" class="outline-3">
<h3 id="org4c01e03"><span class="section-number-3">9.21</span> clojure-mode</h3>
<div class="outline-text-3" id="text-9-21">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package clojure-mode
  :mode (("\\.clj$" . clojure-mode)
	 ("\\.cljs$" . clojurescript-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c6aeb6" class="outline-3">
<h3 id="org0c6aeb6"><span class="section-number-3">9.22</span> vue-mode</h3>
<div class="outline-text-3" id="text-9-22">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vue-mode
  :mode (("\\.vue$" . vue-mode))
  :config
  (setq mmm-js-mode-enter-hook (lambda () (setq syntax-ppss-table nil)))
  (setq mmm-typescript-mode-enter-hook (lambda () (setq syntax-ppss-table nil)))
  (setq indent-tabs-mode nil
	js-indent-level 2))
</pre>
</div>
</div>
</div>
<div id="outline-container-org28de2d6" class="outline-3">
<h3 id="org28de2d6"><span class="section-number-3">9.23</span> glsl-mode</h3>
<div class="outline-text-3" id="text-9-23">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package glsl-mode
  :mode (("\\.vsh$" . glsl-mode)
	 ("\\.fsh$" . glsl-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org598c8d4" class="outline-3">
<h3 id="org598c8d4"><span class="section-number-3">9.24</span> emmet-mode</h3>
<div class="outline-text-3" id="text-9-24">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emmet-mode
  :init
  (add-hook 'web-mode-hook 'emmet-mode)
  (add-hook 'vue-mode 'emmet-mode)
  :config
  (define-key emmet-mode-keymap (kbd "C-j") nil))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb3bd9e7" class="outline-3">
<h3 id="orgb3bd9e7"><span class="section-number-3">9.25</span> nyan-mode</h3>
<div class="outline-text-3" id="text-9-25">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package nyan-mode
  :init
  (nyan-mode)
  (nyan-start-animation)
  :config
  (setq nyan-wavy-trail t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4d68fa6" class="outline-3">
<h3 id="org4d68fa6"><span class="section-number-3">9.26</span> haskell-mode</h3>
<div class="outline-text-3" id="text-9-26">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package haskell-mode
  :mode (("\\.hs$" . haskell-mode)
	 ("\\.lhs$" . literate-haskell-mode)
	 ("\\.cable$" . haskell-cabal-mode))
  :bind (("C-m" . nil)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3d4b6ef" class="outline-3">
<h3 id="org3d4b6ef"><span class="section-number-3">9.27</span> gradle-mode</h3>
<div class="outline-text-3" id="text-9-27">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package gradle-mode
  :mode (("\\.gradle$" . java-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org17bd798" class="outline-3">
<h3 id="org17bd798"><span class="section-number-3">9.28</span> cmake-mode</h3>
<div class="outline-text-3" id="text-9-28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package cmake-mode
  :mode (("\\.cmake$" . cmake-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org59ac9b2" class="outline-3">
<h3 id="org59ac9b2"><span class="section-number-3">9.29</span> toml-mode</h3>
<div class="outline-text-3" id="text-9-29">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package toml-mode
  :mode (("\\.toml$" . toml-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8df4dfc" class="outline-3">
<h3 id="org8df4dfc"><span class="section-number-3">9.30</span> gitignore-mode</h3>
<div class="outline-text-3" id="text-9-30">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package gitignore-mode
  :mode (("\\.dockerignore$" . gitignore-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org56bce3a" class="outline-3">
<h3 id="org56bce3a"><span class="section-number-3">9.31</span> plantuml-mode</h3>
<div class="outline-text-3" id="text-9-31">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package plantuml-mode
  :mode (("\\.pu$" . plantuml-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaedf692" class="outline-3">
<h3 id="orgaedf692"><span class="section-number-3">9.32</span> processing-mode</h3>
<div class="outline-text-3" id="text-9-32">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package processing-mode
  :mode (("\\.pde$" . processing-mode))
  :config
  (setq processing-location "/opt/processing/processing-java")
  (setq processing-output-dir "/tmp"))
</pre>
</div>
</div>
</div>
<div id="outline-container-org9fc766a" class="outline-3">
<h3 id="org9fc766a"><span class="section-number-3">9.33</span> csharp-mode</h3>
<div class="outline-text-3" id="text-9-33">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package csharp-mode
  :mode (("\\.cs$" . csharp-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org76f34a3" class="outline-3">
<h3 id="org76f34a3"><span class="section-number-3">9.34</span> docker-compose-mode</h3>
<div class="outline-text-3" id="text-9-34">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package docker-compose-mode
  :mode (("docker-compose*" . docker-compose-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org65c0b5e" class="outline-3">
<h3 id="org65c0b5e"><span class="section-number-3">9.35</span> rust-mode</h3>
<div class="outline-text-3" id="text-9-35">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rust-mode
  :mode (("\\.rs$" . rust-mode)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1c17d12" class="outline-2">
<h2 id="org1c17d12"><span class="section-number-2">10</span> Refactor</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org572e5d6" class="outline-3">
<h3 id="org572e5d6"><span class="section-number-3">10.1</span> emr</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emr
  :bind (("M-RET" . 'emr-show-refactor-menu)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org75d9422" class="outline-3">
<h3 id="org75d9422"><span class="section-number-3">10.2</span> js2-refactor</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package js2-refactor
  :ensure t
  :init
  (add-hook 'js2-mode-hook #'js2-refactor-mode)
  (add-hook 'typescript-mode-hook #'js2-refactor-mode)
  :config
  (js2r-add-keybindings-with-prefix "C-c C-m"))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b28442" class="outline-3">
<h3 id="org1b28442"><span class="section-number-3">10.3</span> ruby-refactor</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ruby-refactor
  :ensure t
  :init
  (add-hook 'ruby-mode-hook 'ruby-refactor-mode-launch))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd05f08" class="outline-2">
<h2 id="orgbd05f08"><span class="section-number-2">11</span> MyFunc</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org25fdc62" class="outline-3">
<h3 id="org25fdc62"><span class="section-number-3">11.1</span> my/beginning-of-intendation</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/beginning-of-intendation ()
  "move to beginning of line, or indentation"
  (interactive)
  (back-to-indentation))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf9c183f" class="outline-3">
<h3 id="orgf9c183f"><span class="section-number-3">11.2</span> my/ido-recentf</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/ido-recentf ()
  (interactive)
  (find-file (ido-completing-read "Find recent file: " recentf-list)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc28c02" class="outline-3">
<h3 id="orgcc28c02"><span class="section-number-3">11.3</span> my/suspend</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/suspend ()
  (interactive)
  (shell-command-to-string "systemctl suspend"))
</pre>
</div>
</div>
</div>
<div id="outline-container-org83d50c0" class="outline-3">
<h3 id="org83d50c0"><span class="section-number-3">11.4</span> my/counsel-fd</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/counsel-fd ()
  (interactive)
  (let* ((current-directory (file-name-directory (or buffer-file-name default-directory)))
	 (default-directory (expand-file-name (or (locate-dominating-file default-directory ".git")
						  current-directory)))
	 (files (split-string (shell-command-to-string "fd -L -I --hidden -a --color never"))))
    (ivy-read "Choose: " files
	      :action (lambda (x)
			(let ((expanded-name (expand-file-name x)))
			  (if (file-directory-p expanded-name)
			      (counsel-find-file (concat expanded-name "/"))
			    (find-file expanded-name))))
	      :caller 'my/counsel-fd)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org78901ea" class="outline-3">
<h3 id="org78901ea"><span class="section-number-3">11.5</span> my/before-set-auto-mode</h3>
<div class="outline-text-3" id="text-11-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/before-set-auto-mode ()
  (when (or (and buffer-file-name
		 (&gt; (file-attribute-size (file-attributes buffer-file-name)) 100000))
	    (&gt; (line-number-at-pos (point-max)) 10000))
    (prog1 t
      (prog-mode))))

(advice-add 'set-auto-mode :before-until 'my/before-set-auto-mode)
</pre>
</div>
</div>
</div>
