index.org
** my/exec-npm-script
   #+BEGIN_SRC emacs-lisp
     (defun my/exec-npm-script ()
       (interactive)
       (let* ((npm-root (and default-directory (locate-dominating-file default-directory "package.json")))
              (default-directory (or npm-root default-directory))
              choice scripts command-names)
         (unless npm-root
           (user-error "package.json not found..."))
         (setq scripts (cdr-safe (assq 'scripts (json-read-file (file-relative-name "package.json" default-directory)))))
         (setq command-names (mapcar #'(lambda (s) (symbol-name (car s))) scripts))
         (setq choice (intern (completing-read "choice command: " command-names)))
         (setq command (cdr-safe (assq choice scripts)))
         (when command
           (compile command))))
   #+END_SRC
** my/slime-history
   #+BEGIN_SRC emacs-lisp
     (defun my/slime-history ()
       (interactive)
       (insert
        (completing-read
         "choice history: "
         (with-temp-buffer
           (insert-file-contents "~/.slime-history.eld")
           (let ((read-circle t))
             (nreverse (read (current-buffer))))))))
   #+END_SRC
** my/ielm-history
   #+BEGIN_SRC emacs-lisp
     (defun my/ielm-history ()
       (interactive)
       (insert
        (completing-read
         "choice history: "
         (progn
           (let ((history nil))
             (dotimes (index (ring-length comint-input-ring))
               (push (ring-ref comint-input-ring index) history))
             history)))))
   #+END_SRC
** my/irb-history
   #+BEGIN_SRC emacs-lisp
     (defun my/irb-history ()
       (interactive)
       (insert
        (completing-read
         "choose history: "
         (-map #'list (-distinct (s-lines (f-read-text "~/.irb_history")))))))

     (define-key inf-ruby-mode-map (kbd "C-c C-r") 'my/irb-history)
   #+END_SRC
** my/neotree-toggle
   #+BEGIN_SRC emacs-lisp
     (defun my/neotree-toggle ()
       (interactive)
       (let ((default-directory (locate-dominating-file default-directory ".git")))
         (neotree-toggle)))
   #+END_SRC
* Keybind
** 基本設定
   #+BEGIN_SRC emacs-lisp
     (keyboard-translate ?\C-h ?\C-?)
     (progn
       (bind-key "C-a" 'my/beginning-of-intendation)
       (bind-key "C-z" 'undo)
       (bind-key "C-h" 'delete-backward-char)
       (bind-key "C-?" 'help-command)
       (bind-key "C-m" 'set-mark-command)
       (bind-key "C-q" 'my/neotree-toggle)
       (bind-key "C-x j" 'open-junk-file)
       (bind-key "C-c i" 'find-function)
       (bind-key "C-c c" 'org-capture)
       (bind-key "C-c a" 'org-agenda)
       (bind-key "C-x o" 'ace-window)
       (bind-key "C-x C-o" 'ace-window)
       (bind-key "C-x g" 'magit-status)
       (bind-key "C-c l" 'magit-blame)
       (bind-key "C-c j" 'counsel-git)
       (bind-key "C-c k" 'my/counsel-ag)
       (bind-key "C-x C-r" 'counsel-recentf)
       (bind-key "C-x C-f" 'counsel-find-file)
       (bind-key "M-x" 'counsel-M-x)
       (bind-key "M-p" 'my/counsel-fd)
       (bind-key "M-g" 'google-this)
       (bind-key "C-x m" 'counsel-compile)
       (bind-key "C-x C-k" nil))
   #+END_SRC
