index.html
<div id="outline-container-orgece2e2d" class="outline-3">
<h3 id="orgece2e2d"><span class="section-number-3">11.6</span> my/exec-npm-script</h3>
<div class="outline-text-3" id="text-11-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/exec-npm-script ()
  (interactive)
  (let* ((npm-root (and default-directory (locate-dominating-file default-directory "package.json")))
	 (default-directory (or npm-root default-directory))
	 choice scripts command-names)
    (unless npm-root
      (user-error "package.json not found..."))
    (setq scripts (cdr-safe (assq 'scripts (json-read-file (file-relative-name "package.json" default-directory)))))
    (setq command-names (mapcar #'(lambda (s) (symbol-name (car s))) scripts))
    (setq choice (intern (completing-read "choice command: " command-names)))
    (setq command (cdr-safe (assq choice scripts)))
    (when command
      (compile command))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbce5bda" class="outline-3">
<h3 id="orgbce5bda"><span class="section-number-3">11.7</span> my/slime-history</h3>
<div class="outline-text-3" id="text-11-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/slime-history ()
  (interactive)
  (insert
   (completing-read
    "choice history: "
    (with-temp-buffer
      (insert-file-contents "~/.slime-history.eld")
      (let ((read-circle t))
	(nreverse (read (current-buffer))))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3c855dc" class="outline-3">
<h3 id="org3c855dc"><span class="section-number-3">11.8</span> my/ielm-history</h3>
<div class="outline-text-3" id="text-11-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/ielm-history ()
  (interactive)
  (insert
   (completing-read
    "choice history: "
    (progn
      (let ((history nil))
	(dotimes (index (ring-length comint-input-ring))
	  (push (ring-ref comint-input-ring index) history))
	history)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4bff871" class="outline-3">
<h3 id="org4bff871"><span class="section-number-3">11.9</span> my/irb-history</h3>
<div class="outline-text-3" id="text-11-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/irb-history ()
  (interactive)
  (insert
   (completing-read
    "choose history: "
    (-map #'list (-distinct (s-lines (f-read-text "~/.irb_history")))))))

(define-key inf-ruby-mode-map (kbd "C-c C-r") 'my/irb-history)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc3a83f5" class="outline-3">
<h3 id="orgc3a83f5"><span class="section-number-3">11.10</span> my/neotree-toggle</h3>
<div class="outline-text-3" id="text-11-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/neotree-toggle ()
  (interactive)
  (let ((default-directory (locate-dominating-file default-directory ".git")))
    (neotree-toggle)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdb3ddf3" class="outline-2">
<h2 id="orgdb3ddf3"><span class="section-number-2">12</span> Keybind</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org6b72808" class="outline-3">
<h3 id="org6b72808"><span class="section-number-3">12.1</span> 基本設定</h3>
<div class="outline-text-3" id="text-12-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(keyboard-translate ?\C-h ?\C-?)
(progn
  (bind-key "C-a" 'my/beginning-of-intendation)
  (bind-key "C-z" 'undo)
  (bind-key "C-h" 'delete-backward-char)
  (bind-key "C-?" 'help-command)
  (bind-key "C-m" 'set-mark-command)
  (bind-key "C-q" 'my/neotree-toggle)
  (bind-key "C-x j" 'open-junk-file)
  (bind-key "C-c i" 'find-function)
  (bind-key "C-c c" 'org-capture)
  (bind-key "C-c a" 'org-agenda)
  (bind-key "C-x o" 'ace-window)
  (bind-key "C-x C-o" 'ace-window)
  (bind-key "C-x g" 'magit-status)
  (bind-key "C-c l" 'magit-blame)
  (bind-key "C-c j" 'counsel-git)
  (bind-key "C-c k" 'my/counsel-ag)
  (bind-key "C-x C-r" 'counsel-recentf)
  (bind-key "C-x C-f" 'counsel-find-file)
  (bind-key "M-x" 'counsel-M-x)
  (bind-key "M-p" 'my/counsel-fd)
  (bind-key "M-g" 'google-this)
  (bind-key "C-x m" 'counsel-compile)
  (bind-key "C-x C-k" nil))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: takeounn</p>
<p class="date">Created: 2020-05-09 Sat 19:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
